/*
    GameData数据内容说明:
        recipe_data：配方表
            记录配方数据的数组，数组中每一个元素即是一个配方的数据，以字典形式存储，其中各个键值对意义为：
                原料：完成一趟此配方需要的物品类型及相应数目
                产物：完成一趟此配方将产出的物品类型及相应数目
                设施：可以用于完成此配方的工厂类型
                时间：完成一趟此配方所需要的时间。其中，较为特殊的是：
                    采矿设备的时间规定为1s，即小矿机在矿物利用等级为1级时开采2簇矿物时的单位矿物产出时间
                    采集器的时间定规为1s，是矿物利用等级为1级时采集器在面板为0.125/s的巨星上采集的算入供电消耗前的单位矿物产出时间
                    抽水设备的时间规定为1.2s，是矿物利用等级为1级时单个抽水机的单位产出时间
                    抽油设备的时间规定为1s,是矿物利用等级为1级时单个萃取站在面板为1/s的油井上的单位产出时间
                    分馏塔的时间规定为100s，是让氢以1/s速度过带时的期望单位产出时间
                    蓄电器（满）的时间定为300s，是直接接入电网时充满电的时间（直接接入电网，设备倍率为1，使用能量枢纽，则设备倍率为50）
                增产：此配方的可增产情况，可以看做是2位2进制数所表示的一个值，第一位代表是否能加速，第二位代表是否能增产，比如0代表此配方既不能增产也不能加速，
                    2代表可以加速但不能增产，3代表既可以加速也可以增产等...其中，存在一个特例，当使用射线接受站接受光子时用上引力透镜，则引力透镜加速时可以让
                    产出翻倍，但不增加引力透镜消耗速度，**用4表示这种只能加速但不加倍原料消耗的配方
        
        proliferator_data：增产剂效果字典
            记录增产剂效能的数组，数组中第i个元素即为第i级增产剂的数据，以字典形式存储，其中各个键值对的意义为：
                增产剂名称：增产剂在游戏中的名字，其中，0级增产剂名为“不使用增产剂
                增产效果：使用此增产剂在额外产出模式时的产出倍率，如3级增产剂的增产效果为1.25
                加速效果：使用此增产剂在生产加速模式时的产出倍率，如3级增产剂的加速效果为2
                耗电倍率：使用此增产剂时工厂的耗电倍率，如3级增产剂的耗电倍率为2.5
                喷涂次数：增产剂在未被喷涂的情况下的面板喷涂次数，如3级增产剂的喷涂次数为60
        
        factory_data:建筑参数表
            记录各种工厂数值的字典，字典的键名为设施种类，如“制造台”、“冶炼设备”等，建值为属于这一设备种类的设备参数，以字典形式储存，字典中的键名为建筑名字，
            建值则是代表这一建筑参数的字典，字典中各个键值对的意义为：
                耗能：工厂的额定工作功率，单位为MW，如制造台MK.Ⅲ的耗能为1.08
                倍率：工厂的额定工作速度，即实际生产速度与配方面板速度的比值，如制造台MK.Ⅲ的倍率为1.5
                占地：目前定义为工厂建筑的占地面积，因为工厂的实际占地面积计算较为复杂。当前的想法是这个表的数据仅用作记录工厂建筑本身的占地面积，占地的单位
                    面积定义为游戏中一纬线间隔的平方（即游戏内的约1.256637m），之后通过其他数据结构来给涉及物品数目不同的相同建筑通过算法将进出货物时的分拣
                    器与传送带的占地也考虑上，届时会有不同的铺设模式对应不同的分拣器传送带占地。建筑占地本身也会因是否使用建筑偏移而有所改动。
*/
var GameData = {
    vanilla: {
        "Version": "0.9.27.15466",
        "recipe_data": [
            {
                "原料": {},
                "产物": {
                    "木材": 1
                },
                "设施": "轻型工业机甲",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "植物燃料": 1
                },
                "设施": "轻型工业机甲",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "铁矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "铜矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "石矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "煤矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "硅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "石矿": 10
                },
                "产物": {
                    "硅石": 1
                },
                "设施": "冶炼设备",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {},
                "产物": {
                    "钛石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "水": 1
                },
                "设施": "抽水设备",
                "时间": 1.2,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "原油": 1
                },
                "设施": "抽油设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "氢": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "重氢": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "氢": 10
                },
                "产物": {
                    "重氢": 5
                },
                "设施": "粒子对撞机",
                "时间": 2.5,
                "增产": 2
            },
            {
                "原料": {
                    "氢": 1
                },
                "产物": {
                    "重氢": 1
                },
                "设施": "分馏设备",
                "时间": 100,
                "增产": 2
            },
            {
                "原料": {
                    "临界光子": 2
                },
                "产物": {
                    "反物质": 2,
                    "氢": 2
                },
                "设施": "粒子对撞机",
                "时间": 2,
                "增产": 2
            },
            {
                "原料": {},
                "产物": {
                    "可燃冰": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "可燃冰": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "金伯利矿石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "分形硅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "光栅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "有机晶体": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "塑料": 2,
                    "精炼油": 1,
                    "水": 1
                },
                "产物": {
                    "有机晶体": 1
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "木材": 20,
                    "植物燃料": 20,
                    "水": 10
                },
                "产物": {
                    "有机晶体": 1
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {},
                "产物": {
                    "刺笋结晶": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "单极磁石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "临界光子": 1
                },
                "设施": "射线接收站",
                "时间": 10,
                "增产": 0
            },
            {
                "原料": {
                    "引力透镜": 0.008333
                },
                "产物": {
                    "临界光子": 1
                },
                "设施": "射线接收站",
                "时间": 5,
                "增产": 9
            },
            {
                "原料": {},
                "产物": {
                    "硫酸": 1
                },
                "设施": "抽水设备",
                "时间": 1.2,
                "增产": 0
            },
            {
                "原料": {
                    "精炼油": 6,
                    "石矿": 8,
                    "水": 4
                },
                "产物": {
                    "硫酸": 4
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁矿": 1
                },
                "产物": {
                    "铁块": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "铜矿": 1
                },
                "产物": {
                    "铜块": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "硅石": 2
                },
                "产物": {
                    "高纯硅块": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛石": 2
                },
                "产物": {
                    "钛块": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "石矿": 1
                },
                "产物": {
                    "石材": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "煤矿": 2
                },
                "产物": {
                    "高能石墨": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 1,
                    "氢": 2
                },
                "产物": {
                    "高能石墨": 1,
                    "氢": 3
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "石矿": 2
                },
                "产物": {
                    "玻璃": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁矿": 1
                },
                "产物": {
                    "磁铁": 1
                },
                "设施": "冶炼设备",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "金伯利矿石": 1
                },
                "产物": {
                    "金刚石": 2
                },
                "设施": "冶炼设备",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "高能石墨": 1
                },
                "产物": {
                    "金刚石": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "分形硅石": 1
                },
                "产物": {
                    "晶格硅": 2
                },
                "设施": "制造台",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 1
                },
                "产物": {
                    "晶格硅": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 3
                },
                "产物": {
                    "钢材": 1
                },
                "设施": "冶炼设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "硫酸": 8,
                    "钛块": 4,
                    "钢材": 4
                },
                "产物": {
                    "钛合金": 4
                },
                "设施": "冶炼设备",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "原油": 2
                },
                "产物": {
                    "精炼油": 2,
                    "氢": 1
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 2,
                    "高能石墨": 1
                },
                "产物": {
                    "塑料": 1
                },
                "设施": "化工设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "硫酸": 1,
                    "高能石墨": 3
                },
                "产物": {
                    "石墨烯": 2
                },
                "设施": "化工设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "可燃冰": 2
                },
                "产物": {
                    "石墨烯": 2,
                    "氢": 1
                },
                "设施": "化工设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 1,
                    "石墨烯": 3
                },
                "产物": {
                    "碳纳米管": 2
                },
                "设施": "化工设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "刺笋结晶": 6
                },
                "产物": {
                    "碳纳米管": 2
                },
                "设施": "化工设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 1
                },
                "产物": {
                    "齿轮": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "玻璃": 3
                },
                "产物": {
                    "棱镜": 2
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "铜块": 1
                },
                "产物": {
                    "电路板": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "磁铁": 2,
                    "铜块": 1
                },
                "产物": {
                    "磁线圈": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 2,
                    "铜块": 1
                },
                "产物": {
                    "微晶元件": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 3,
                    "有机晶体": 1
                },
                "产物": {
                    "钛晶石": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 4,
                    "棱镜": 2
                },
                "产物": {
                    "电浆激发器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 1,
                    "铁块": 2,
                    "齿轮": 1
                },
                "产物": {
                    "电动机": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 2,
                    "电动机": 2
                },
                "产物": {
                    "电磁涡轮": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 2,
                    "微晶元件": 2
                },
                "产物": {
                    "处理器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 2,
                    "晶格硅": 2,
                    "塑料": 1
                },
                "产物": {
                    "粒子宽带": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 4,
                    "高纯硅块": 1,
                    "钛合金": 1
                },
                "产物": {
                    "框架材料": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 1,
                    "棱镜": 2
                },
                "产物": {
                    "光子合并器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 1,
                    "光栅石": 1
                },
                "产物": {
                    "光子合并器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电磁涡轮": 2,
                    "铜块": 2,
                    "石墨烯": 2
                },
                "产物": {
                    "粒子容器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "单极磁石": 10,
                    "铜块": 2
                },
                "产物": {
                    "粒子容器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "电磁涡轮": 2,
                    "磁铁": 3,
                    "高能石墨": 1
                },
                "产物": {
                    "超级磁场环": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 4,
                    "奇异物质": 1
                },
                "产物": {
                    "引力透镜": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "玻璃": 2,
                    "钛块": 2,
                    "水": 2
                },
                "产物": {
                    "钛化玻璃": 2
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "钛晶石": 1,
                    "石墨烯": 2,
                    "氢": 12
                },
                "产物": {
                    "卡西米尔晶体": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "光栅石": 8,
                    "石墨烯": 2,
                    "氢": 12
                },
                "产物": {
                    "卡西米尔晶体": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "卡西米尔晶体": 1,
                    "钛化玻璃": 2
                },
                "产物": {
                    "位面过滤器": 1
                },
                "设施": "制造台",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 2,
                    "位面过滤器": 2
                },
                "产物": {
                    "量子芯片": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 1,
                    "粒子容器": 1
                },
                "产物": {
                    "湮灭约束球": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "粒子容器": 2,
                    "重氢": 10
                },
                "产物": {
                    "奇异物质": 1
                },
                "设施": "粒子对撞机",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "煤矿": 1
                },
                "产物": {
                    "增产剂MK.Ⅰ": 1
                },
                "设施": "制造台",
                "时间": 0.5,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 1,
                    "增产剂MK.Ⅰ": 2
                },
                "产物": {
                    "增产剂MK.Ⅱ": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 1,
                    "增产剂MK.Ⅱ": 2
                },
                "产物": {
                    "增产剂MK.Ⅲ": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 1,
                    "氢": 10
                },
                "产物": {
                    "液氢燃料棒": 2
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 1,
                    "重氢": 20,
                    "超级磁场环": 1
                },
                "产物": {
                    "氘核燃料棒": 2
                },
                "设施": "制造台",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 1,
                    "氢": 12,
                    "反物质": 12,
                    "湮灭约束球": 1
                },
                "产物": {
                    "反物质燃料棒": 2
                },
                "设施": "制造台",
                "时间": 24,
                "增产": 2
            },
            {
                "原料": {
                    "引力透镜": 1
                },
                "产物": {
                    "空间翘曲器": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "引力矩阵": 1
                },
                "产物": {
                    "空间翘曲器": 8
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "石墨烯": 1,
                    "光子合并器": 1
                },
                "产物": {
                    "太阳帆": 2
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "框架材料": 3,
                    "处理器": 3,
                    "太阳帆": 3
                },
                "产物": {
                    "戴森球组件": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "量子芯片": 2,
                    "氘核燃料棒": 4,
                    "戴森球组件": 2
                },
                "产物": {
                    "小型运载火箭": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 1,
                    "电路板": 1
                },
                "产物": {
                    "电磁矩阵": 1
                },
                "设施": "科研设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "高能石墨": 2,
                    "氢": 2
                },
                "产物": {
                    "能量矩阵": 1
                },
                "设施": "科研设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 1,
                    "钛晶石": 1
                },
                "产物": {
                    "结构矩阵": 1
                },
                "设施": "科研设备",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 2,
                    "粒子宽带": 1
                },
                "产物": {
                    "信息矩阵": 1
                },
                "设施": "科研设备",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "引力透镜": 1,
                    "量子芯片": 1
                },
                "产物": {
                    "引力矩阵": 2
                },
                "设施": "科研设备",
                "时间": 24,
                "增产": 3
            },
            {
                "原料": {
                    "电磁矩阵": 1,
                    "能量矩阵": 1,
                    "结构矩阵": 1,
                    "信息矩阵": 1,
                    "引力矩阵": 1,
                    "反物质": 1
                },
                "产物": {
                    "宇宙矩阵": 1
                },
                "设施": "科研设备",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 2,
                    "铜块": 3
                },
                "产物": {
                    "推进器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 5,
                    "电磁涡轮": 5
                },
                "产物": {
                    "加力推进器": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 5,
                    "处理器": 2,
                    "推进器": 2
                },
                "产物": {
                    "物流运输机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "钛合金": 10,
                    "处理器": 10,
                    "加力推进器": 2
                },
                "产物": {
                    "星际物流运输船": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 2
            },
            {
                "原料": {
                    "钢材": 1,
                    "石材": 3
                },
                "产物": {
                    "地基": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "磁线圈": 1
                },
                "产物": {
                    "电力感应塔": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "电力感应塔": 1,
                    "电浆激发器": 3
                },
                "产物": {
                    "无线输电塔": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 2
            },
            {
                "原料": {
                    "无线输电塔": 1,
                    "超级磁场环": 10,
                    "框架材料": 2
                },
                "产物": {
                    "卫星配电站": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 6,
                    "齿轮": 1,
                    "磁线圈": 3
                },
                "产物": {
                    "风力涡轮机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 10,
                    "石材": 4,
                    "齿轮": 4,
                    "磁线圈": 4
                },
                "产物": {
                    "火力发电机": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 10,
                    "铜块": 10,
                    "电路板": 5
                },
                "产物": {
                    "太阳能板": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 6,
                    "超级磁场环": 1,
                    "晶格硅": 6
                },
                "产物": {
                    "蓄电器": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "蓄电器": 1
                },
                "产物": {
                    "蓄电器（满）": 1
                },
                "设施": "充电设备",
                "时间": 300,
                "增产": 0
            },
            {
                "原料": {
                    "钢材": 15,
                    "超级磁场环": 1,
                    "铜块": 20,
                    "光子合并器": 4
                },
                "产物": {
                    "地热发电站": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 12,
                    "超级磁场环": 10,
                    "碳纳米管": 8,
                    "处理器": 4
                },
                "产物": {
                    "微型聚变发电站": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 40,
                    "钛合金": 40,
                    "处理器": 40,
                    "粒子容器": 8
                },
                "产物": {
                    "能量枢纽": 1
                },
                "设施": "制造台",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 20,
                    "高纯硅块": 20,
                    "处理器": 5,
                    "光子合并器": 10,
                    "超级磁场环": 20
                },
                "产物": {
                    "射线接收站": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "框架材料": 20,
                    "湮灭约束球": 10,
                    "量子芯片": 10
                },
                "产物": {
                    "人造恒星": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "齿轮": 1
                },
                "产物": {
                    "传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "传送带": 3,
                    "电磁涡轮": 1
                },
                "产物": {
                    "高速传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "高速传送带": 3,
                    "超级磁场环": 1,
                    "石墨烯": 1
                },
                "产物": {
                    "极速传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 3,
                    "齿轮": 2,
                    "电路板": 1
                },
                "产物": {
                    "四向分流器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 3,
                    "超级磁场环": 1,
                    "齿轮": 4,
                    "处理器": 2
                },
                "产物": {
                    "自动集装机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 3,
                    "电路板": 2,
                    "齿轮": 2,
                    "玻璃": 1
                },
                "产物": {
                    "流速监测器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 4,
                    "石材": 4
                },
                "产物": {
                    "小型储物仓": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "石材": 8
                },
                "产物": {
                    "大型储物仓": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "石材": 4,
                    "玻璃": 4
                },
                "产物": {
                    "储液罐": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 40,
                    "钢材": 40,
                    "处理器": 40,
                    "粒子容器": 20
                },
                "产物": {
                    "行星内物流运输站": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 40,
                    "粒子容器": 20,
                    "行星内物流运输站": 1
                },
                "产物": {
                    "星际物流运输站": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 2
            },
            {
                "原料": {
                    "超级磁场环": 50,
                    "加力推进器": 20,
                    "蓄电器（满）": 20,
                    "星际物流运输站": 1
                },
                "产物": {
                    "轨道采集器": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 1,
                    "电路板": 1
                },
                "产物": {
                    "分拣器": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "分拣器": 2,
                    "电动机": 1
                },
                "产物": {
                    "高速分拣器": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "高速分拣器": 2,
                    "电磁涡轮": 1
                },
                "产物": {
                    "极速分拣器": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 4,
                    "电路板": 2,
                    "磁线圈": 2,
                    "齿轮": 2
                },
                "产物": {
                    "采矿机": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "框架材料": 10,
                    "超级磁场环": 10,
                    "量子芯片": 2,
                    "光栅石": 40
                },
                "产物": {
                    "大型采矿机": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "电路板": 2,
                    "电动机": 4,
                    "石材": 4
                },
                "产物": {
                    "抽水机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 12,
                    "电路板": 6,
                    "石材": 12,
                    "电浆激发器": 4
                },
                "产物": {
                    "原油萃取站": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 10,
                    "电路板": 6,
                    "石材": 10,
                    "电浆激发器": 6
                },
                "产物": {
                    "原油精炼厂": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "处理器": 1,
                    "石材": 4,
                    "玻璃": 4
                },
                "产物": {
                    "分馏塔": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "处理器": 8,
                    "框架材料": 20,
                    "超级磁场环": 25,
                    "石墨烯": 10
                },
                "产物": {
                    "微型粒子对撞机": 1
                },
                "设施": "制造台",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 20,
                    "处理器": 5,
                    "齿轮": 20,
                    "超级磁场环": 10
                },
                "产物": {
                    "电磁轨道弹射器": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 80,
                    "框架材料": 30,
                    "引力透镜": 20,
                    "量子芯片": 10
                },
                "产物": {
                    "垂直发射井": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 4,
                    "齿轮": 8,
                    "电路板": 4
                },
                "产物": {
                    "制造台MK.Ⅰ": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 4,
                    "石墨烯": 8,
                    "制造台MK.Ⅰ": 1
                },
                "产物": {
                    "制造台MK.Ⅱ": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 2
            },
            {
                "原料": {
                    "量子芯片": 2,
                    "粒子宽带": 8,
                    "制造台MK.Ⅱ": 1
                },
                "产物": {
                    "制造台MK.Ⅲ": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 4,
                    "电路板": 4,
                    "磁线圈": 2,
                    "石材": 2
                },
                "产物": {
                    "电弧熔炉": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电弧熔炉": 1,
                    "框架材料": 5,
                    "位面过滤器": 4,
                    "单极磁石": 15
                },
                "产物": {
                    "位面熔炉": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 2
            },
            {
                "原料": {
                    "钢材": 4,
                    "电浆激发器": 2,
                    "电路板": 2,
                    "微晶元件": 2
                },
                "产物": {
                    "喷涂机": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "石材": 8,
                    "电路板": 2,
                    "玻璃": 8
                },
                "产物": {
                    "化工厂": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "玻璃": 4,
                    "电路板": 4,
                    "磁线圈": 4
                },
                "产物": {
                    "研究站": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 2,
                    "氢": 1,
                    "煤矿": 1
                },
                "产物": {
                    "精炼油": 3
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 2,
                    "处理器": 1,
                    "电磁涡轮": 1
                },
                "产物": {
                    "配送运输机": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "处理器": 4,
                    "电浆激发器": 4
                },
                "产物": {
                    "物流配送器": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "化工厂": 1,
                    "钛化玻璃": 10,
                    "奇异物质": 3,
                    "量子芯片": 3
                },
                "产物": {
                    "量子化工厂": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 2
            }
        ],
        "proliferator_data": [
            {
                "增产剂名称": "不使用增产剂",
                "增产效果": 1,
                "加速效果": 1,
                "耗电倍率": 1,
                "喷涂次数": 1,
                "单次喷涂最高增产点数": 0
            },
            {
                "增产剂名称": "增产剂MK.Ⅰ",
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
                "喷涂次数": 12,
                "单次喷涂最高增产点数": 1
            },
            {
                "增产剂名称": "增产剂MK.Ⅱ",
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
                "喷涂次数": 24,
                "单次喷涂最高增产点数": 2
            },
            {
                "增产剂名称": "增产剂MK.Ⅲ",
                "增产效果": 1.25,
                "加速效果": 2,
                "耗电倍率": 2.5,
                "喷涂次数": 60,
                "单次喷涂最高增产点数": 4
            }
        ],
        "proliferate_effect": [
            {
                "增产效果": 1.0,
                "加速效果": 1.0,
                "耗电倍率": 1.0,
            },
            {
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
            },
            {
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
            },
            {
                "增产效果": 1.225,
                "加速效果": 1.75,
                "耗电倍率": 2.1,
            },
            {
                "增产效果": 1.25,
                "加速效果": 2.0,
                "耗电倍率": 2.5,
            },
            {
                "增产效果": 1.275,
                "加速效果": 2.25,
                "耗电倍率": 2.9,
            },
            {
                "增产效果": 1.3,
                "加速效果": 2.5,
                "耗电倍率": 3.3,
            },
            {
                "增产效果": 1.325,
                "加速效果": 2.75,
                "耗电倍率": 3.7,
            },
            {
                "增产效果": 1.35,
                "加速效果": 3.0,
                "耗电倍率": 4.1,
            },
            {
                "增产效果": 1.375,
                "加速效果": 3.25,
                "耗电倍率": 4.5,
            },
            {
                "增产效果": 1.4,
                "加速效果": 3.5,
                "耗电倍率": 4.9,
            },
        ],
        "factory_data": {
            "轻型工业机甲": [
                {
                    "名称": "伊卡洛斯",
                    "耗能": 0.08,
                    "倍率": 1,
                    "占地": 0
                }
            ],
            "采矿设备": [
                {
                    "名称": "采矿机",
                    "耗能": 0.42,
                    "倍率": 0.5,
                    "占地": 15
                },
                {
                    "名称": "大型采矿机",
                    "耗能": 2.94,
                    "倍率": 1,
                    "占地": 25
                }
            ],
            "抽水设备": [
                {
                    "名称": "抽水机",
                    "耗能": 0.3,
                    "倍率": 1,
                    "占地": 12
                }
            ],
            "抽油设备": [
                {
                    "名称": "原油萃取站",
                    "耗能": 0.3,
                    "倍率": 1,
                    "占地": 50
                }
            ],
            "巨星采集": [
                {
                    "名称": "轨道采集器",
                    "耗能": 30,
                    "倍率": 8,
                    "占地": 0
                }
            ],
            "射线接收站": [
                {
                    "名称": "射线接收站",
                    "耗能": 0,
                    "倍率": 1,
                    "占地": 54.82
                }
            ],
            "冶炼设备": [
                {
                    "名称": "电弧熔炉",
                    "耗能": 0.36,
                    "倍率": 1,
                    "占地": 5.76
                },
                {
                    "名称": "位面熔炉",
                    "耗能": 1.44,
                    "倍率": 2,
                    "占地": 5.76
                }
            ],
            "制造台": [
                {
                    "名称": "制造台MK.Ⅰ",
                    "耗能": 0.27,
                    "倍率": 0.75,
                    "占地": 10.24
                },
                {
                    "名称": "制造台MK.Ⅱ",
                    "耗能": 0.54,
                    "倍率": 1,
                    "占地": 10.24
                },
                {
                    "名称": "制造台MK.Ⅲ",
                    "耗能": 1.08,
                    "倍率": 1.5,
                    "占地": 10.24
                }
            ],
            "精炼设备": [
                {
                    "名称": "原油精炼厂",
                    "耗能": 0.96,
                    "倍率": 1,
                    "占地": 18
                }
            ],
            "化工设备": [
                {
                    "名称": "化工厂",
                    "耗能": 0.72,
                    "倍率": 1,
                    "占地": 23.76
                },
                {
                    "名称": "量子化工厂",
                    "耗能": 2.16,
                    "倍率": 2,
                    "占地": 23.76
                }
            ],
            "分馏设备": [
                {
                    "名称": "分馏塔",
                    "耗能": 0.72,
                    "倍率": 1,
                    "占地": 12.96
                }
            ],
            "粒子对撞机": [
                {
                    "名称": "微型粒子对撞机",
                    "耗能": 12,
                    "倍率": 1,
                    "占地": 45.12
                }
            ],
            "科研设备": [
                {
                    "名称": "研究站",
                    "耗能": 0.48,
                    "倍率": 1,
                    "占地": 20.25
                }
            ],
            "充电设备": [
                {
                    "名称": "能量枢纽",
                    "耗能": 45,
                    "倍率": 50,
                    "占地": 64
                },
                {
                    "名称": "蓄电器",
                    "耗能": 0.9,
                    "倍率": 1,
                    "占地": 4
                }
            ]
        }
    },
    GenesisBook: {
        "Version": "2.8.25",
        "recipe_data": [{'原料': {}, '产物': {'水': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'铁矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'铜矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'硅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'钛石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'石矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'煤矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'原油': 1}, '设施': '抽油设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'可燃冰': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'金伯利矿石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'分形硅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'光栅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'刺笋结晶': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'单极磁石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'木材': 1}, '设施': '轻型工业机甲', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'植物燃料': 1}, '设施': '轻型工业机甲', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'硫酸': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'有机晶体': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氢': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'重氢': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'临界光子': 1}, '设施': '射线接收站', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'蓄电器（满）': 1}, '设施': '充电设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'钨矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'铝矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'一氧化碳': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'二氧化碳': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氮': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'放射性矿物': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氦': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氨': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氢氯酸': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'硝酸': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'海水': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氧': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {'铁矿': 2}, '产物': {'铁块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜块': 4}, '产物': {'铜线圈': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿': 2}, '产物': {'铜块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'石材': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2}, '产物': {'齿轮': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '铜块': 1}, '产物': {'电路板': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铝块': 4, '电动机': 1}, '产物': {'风力涡轮机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '铜线圈': 2}, '产物': {'电力感应塔': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜线圈': 1, '电路板': 1}, '产物': {'电磁矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 4, '玻璃': 2, '电路板': 2}, '产物': {'矩阵研究站': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'玻璃': 3}, '产物': {'棱镜': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'三元精金': 40, '光子结晶': 20, '湿件主机': 2}, '产物': {'先驱者晶片': 1}, '设施': '精密组装', '时间': 90.0, '增产': 3}, 
        {'原料': {'棱镜': 2, '铜线圈': 2}, '产物': {'电浆激发器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'电力感应塔': 1, '电浆激发器': 1}, '产物': {'无线输电塔': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 4, '铝合金': 12, '电浆激发器': 4, '电路板': 4}, '产物': {'原油萃取站': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'基础机械组件': 4, '铝合金': 6, '电浆激发器': 4, '电路板': 2}, '产物': {'精炼厂': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'原油': 2}, '产物': {'氢': 2, '煤焦油': 1}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 2}, '产物': {'高能石墨': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高能石墨': 1, '氢': 1}, '产物': {'能量矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '氢': 20, '氧': 10}, '产物': {'氢燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'钢材': 1, '电磁涡轮': 1}, '产物': {'推进器2': 1}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'推进器2': 2, '超级磁场环': 1}, '产物': {'加力推进器': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '铁块': 4, '玻璃': 4, '电路板': 2}, '产物': {'化工厂': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'丙烯': 2, '硫酸': 1}, '产物': {'聚丙烯': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硫酸钠': 2, '水': 4}, '产物': {'硫酸': 2, '氢氧化钠': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高精度装配线': 60, '极速传送带': 240, '钨复合金属': 120, '先进生物电路': 60}, '产物': {'精密制造厂': 1}, '设施': '高精度加工', '时间': 180.0, '增产': 3}, 
        {'原料': {'微型粒子对撞机': 40, '框架材料': 240, '超级磁场环': 120, '湿件主机': 5}, '产物': {'紧凑式回旋加速器': 1}, '设施': '高精度加工', '时间': 180.0, '增产': 3}, 
        {'原料': {'钛晶石': 1, '铝合金': 1}, '产物': {'结构矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'钛晶石': 1, '石墨烯': 2, '氢': 12}, '产物': {'卡西米尔晶体': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'光栅石': 4, '石墨烯': 2, '氢': 12}, '产物': {'卡西米尔晶体': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'玻璃': 2, '钛块': 1}, '产物': {'钛化玻璃': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'高能石墨': 4, '硫酸': 1}, '产物': {'石墨烯': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'可燃冰': 2}, '产物': {'石墨烯': 2, '氢': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石墨烯': 4}, '产物': {'碳纳米管': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 10, '氢氧化钠': 4}, '产物': {'硅石': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'刺笋结晶': 2}, '产物': {'碳纳米管': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'碳纳米管': 2, '晶格硅': 2, '铝块': 2}, '产物': {'粒子宽带': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'高纯硅块': 1}, '产物': {'晶格硅': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'卡西米尔晶体': 1, '钛化玻璃': 2}, '产物': {'位面过滤器': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '钛合金': 20, '超级磁场环': 20, '量子芯片': 5}, '产物': {'微型粒子对撞机': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'氢': 4}, '产物': {'重氢': 2}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'空燃料棒': 1, '重氢': 20, '钨复合金属': 2}, '产物': {'氘核燃料棒': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'三元精金': 20, '反物质约束单元': 12, '先进生物电路': 4}, '产物': {'湮灭约束球': 1}, '设施': '精密组装', '时间': 60.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 40, '钨复合金属': 60, '氦闪约束器': 16, '超级纳米电脑': 1}, '产物': {'人造恒星': 1}, '设施': '高精度加工', '时间': 30.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '反物质': 12, '氢': 12, '反物质约束单元': 1}, '产物': {'反物质燃料棒': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 2}, 
        {'原料': {'基础机械组件': 2, '低速分拣器': 2, '电路板': 2}, '产物': {'基础制造台': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 4, '高速分拣器': 4, '石墨烯': 4}, '产物': {'标准制造单元': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'先进机械组件': 6, '钛合金': 10, '极速分拣器': 12, '处理器': 6}, '产物': {'高精度装配线': 1}, '设施': '标准制造', '时间': 6.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 2, '齿轮': 2}, '产物': {'采矿机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '铁块': 4, '电动机': 2}, '产物': {'抽水站': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'玻璃': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'微晶元件': 2, '塑料基板': 2}, '产物': {'处理器': 1}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'处理器': 2, '位面过滤器': 2}, '产物': {'量子芯片': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'高纯硅块': 2, '铜块': 1}, '产物': {'微晶元件': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '先进化学反应釜': 10, '量子芯片': 60}, '产物': {'巨型化学反应釜': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'处理器': 1, '粒子宽带': 1}, '产物': {'信息矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 2, '铜线圈': 2}, '产物': {'电弧熔炉': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铝合金': 2, '钛合金': 2, '钨复合金属': 2}, '产物': {'三元精金': 1}, '设施': '聚变生产', '时间': 60.0, '增产': 3}, 
        {'原料': {'煤焦油': 1, '氢': 2}, '产物': {'氢': 3, '高能石墨': 1}, '设施': '精炼设备', '时间': 2.0, '增产': 2}, 
        {'原料': {'硅石': 2}, '产物': {'高纯硅块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高能石墨': 1}, '产物': {'金刚石': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'金伯利矿石': 2}, '产物': {'金刚石': 4}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'分形硅石': 2}, '产物': {'晶格硅': 4}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2}, '产物': {'钢材': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 10, '石材': 10, '电动机': 4, '电路板': 4}, '产物': {'火力发电厂': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'钛石': 2}, '产物': {'钛块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 2, '钛块': 2}, '产物': {'钛合金': 2}, '设施': '冶炼设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'铝块': 4, '高纯硅块': 2, '电路板': 1}, '产物': {'太阳能板': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'棱镜': 2, '电路板': 1}, '产物': {'光子合并器': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'光栅石': 1, '电路板': 1}, '产物': {'光子合并器': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 30, '钨复合金属': 60, '混凝土': 360, '高精度装配线': 20, '量子芯片': 120}, '产物': {'精密结构组装厂': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'先进机械组件': 20, '钛合金': 60, '混凝土': 40, '矿物处理厂': 20, '量子芯片': 10}, '产物': {'物质分解设施': 1}, '设施': '高精度加工', '时间': 120.0, '增产': 3}, 
        {'原料': {'聚苯并咪唑(PBI)': 1, '处理器': 1, '光子合并器': 4}, '产物': {'太阳帆': 12}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 20, '钛合金': 20, '超级磁场环': 20, '量子芯片': 4}, '产物': {'电磁轨道弹射器': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 2, '钨复合金属': 10, '光子合并器': 8, '量子芯片': 2}, '产物': {'射线接收站': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'三元精金': 120, '尖端机械组件': 60, '光子结晶': 60, '先驱者晶片': 4}, '产物': {'广播式能源塔': 1}, '设施': '精密组装', '时间': 180.0, '增产': 3}, 
        {'原料': {'临界光子': 2}, '产物': {'反物质': 2, '氢': 2}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'宇宙矩阵粗坯': 1, '反物质': 1}, '产物': {'宇宙矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'铝块': 4, '晶格硅': 2, '电路板': 1}, '产物': {'蓄电器': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'先进机械组件': 4, '混凝土': 16, '处理器': 4}, '产物': {'能量枢纽': 1}, '设施': '标准制造', '时间': 6.0, '增产': 3}, 
        {'原料': {'引力透镜': 1}, '产物': {'空间翘曲器': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'引力矩阵': 1}, '产物': {'空间翘曲器': 8}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'钨复合金属': 1, '聚苯并咪唑(PBI)': 1, '碳纳米管': 2}, '产物': {'框架材料': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'框架材料': 1, '太阳帆': 1}, '产物': {'戴森球组件': 1}, '设施': '标准制造', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 20, '钨复合金属': 40, '钨强化玻璃': 20, '超级纳米电脑': 8}, '产物': {'垂直发射井': 1}, '设施': '高精度加工', '时间': 15.0, '增产': 3}, 
        {'原料': {'戴森球组件': 4, '量子芯片': 2, '氘核燃料棒': 2}, '产物': {'小型运载火箭': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁块': 2, '电动机': 2}, '产物': {'低速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '电动机': 2}, '产物': {'低速分拣器': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '石材': 2}, '产物': {'小型储物仓': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 1, '低速传送带': 1}, '产物': {'四向分流器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'低速分拣器': 4, '电磁涡轮': 2}, '产物': {'高速分拣器': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'低速传送带': 6, '电磁涡轮': 2}, '产物': {'高速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'高速分拣器': 4, '超级磁场环': 2}, '产物': {'极速分拣器': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 4, '石材': 4}, '产物': {'大型储物仓': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'高速传送带': 6, '超级磁场环': 2}, '产物': {'极速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 10, '铝合金': 30, '混凝土': 20, '处理器': 5}, '产物': {'物流运输站': 1}, '设施': '标准制造', '时间': 15.0, '增产': 3}, 
        {'原料': {'铝块': 4, '推进器2': 2}, '产物': {'物流运输机': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'先进机械组件': 20, '铝合金': 60, '混凝土': 40, '碳纳米管': 20, '位面过滤器': 2}, '产物': {'星际物流运输站': 1}, '设施': '标准制造', '时间': 30.0, '增产': 3}, 
        {'原料': {'铝合金': 8, '加力推进器': 2}, '产物': {'星际物流运输船': 1}, '设施': '标准制造', '时间': 15.0, '增产': 3}, 
        {'原料': {'铁块': 1, '铜线圈': 1}, '产物': {'电动机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'电动机': 1, '高能石墨': 1}, '产物': {'电磁涡轮': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'电磁涡轮': 2, '铜块': 2, '石墨烯': 2}, '产物': {'粒子容器': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'单极磁石': 6, '石墨烯': 2}, '产物': {'粒子容器': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'氘核燃料棒': 1, '氦三燃料棒': 1, '氦闪约束器': 1}, '产物': {'氘氦混合聚变燃料棒': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '氦三': 20, '钨复合金属': 2}, '产物': {'氦三燃料棒': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'金刚石': 4, '奇异物质': 1}, '产物': {'引力透镜': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'引力透镜': 1, '量子芯片': 1}, '产物': {'引力矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'电磁涡轮': 1, '钛块': 1}, '产物': {'超级磁场环': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'粒子容器': 2, '铁块': 2, '重氢': 10}, '产物': {'奇异物质': 1}, '设施': '粒子对撞机', '时间': 6.0, '增产': 3}, 
        {'原料': {'氦': 4}, '产物': {'氦三': 1}, '设施': '粒子对撞机', '时间': 4.0, '增产': 3}, 
        {'原料': {'光栅石': 1}, '产物': {'氦': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'碳纳米管': 2, '三氯化铁': 1}, '产物': {'增产剂': 1}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '混凝土': 10, '钛化玻璃': 4, '量子芯片': 2}, '产物': {'喷涂机': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'三元精金': 240, '尖端机械组件': 120, '湮灭约束球': 120, '先驱者晶片': 8}, '产物': {'反物质能量炉': 1}, '设施': '精密组装', '时间': 180.0, '增产': 3}, 
        {'原料': {'星际物流运输站': 1, '超级磁场环': 20}, '产物': {'轨道采集器': 1}, '设施': '标准制造', '时间': 30.0, '增产': 3}, 
        {'原料': {'石材': 2, '钢材': 2}, '产物': {'地基': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '铝合金': 30, '混凝土': 20, '超级磁场环': 16, '处理器': 4}, '产物': {'裂变能源发电站': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁块': 2, '石材': 2, '玻璃': 2}, '产物': {'储液罐': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钨复合金属': 8, '超级磁场环': 4, '量子芯片': 1}, '产物': {'氦闪约束器': 1}, '设施': '高精度加工', '时间': 15.0, '增产': 3}, 
        {'原料': {'先进机械组件': 4, '钛合金': 8, '位面过滤器': 4}, '产物': {'位面熔炉': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'铝块': 1, '电路板': 1}, '产物': {'流速监测器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 8, '钛合金': 8, '光子合并器': 4, '超级磁场环': 2}, '产物': {'地热发电站': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 20, '钛合金': 60, '钨强化玻璃': 20, '量子芯片': 10}, '产物': {'大型采矿机': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '低速传送带': 2, '电路板': 2}, '产物': {'自动集装机': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'框架材料': 8, '超级磁场环': 4, '量子芯片': 4}, '产物': {'反物质约束单元': 1}, '设施': '高精度加工', '时间': 30.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铝合金': 2, '电路板': 1}, '产物': {'物流配送器': 1}, '设施': '制造台', '时间': 8.0, '增产': 3}, 
        {'原料': {'铝块': 2, '电磁涡轮': 1, '电路板': 1}, '产物': {'配送运输机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 2, '钛化玻璃': 12, '钛合金': 12, '处理器': 6}, '产物': {'先进化学反应釜': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'光子结晶': 1}, '产物': {'临界光子': 1, '光子结晶': 1}, '设施': '聚变生产', '时间': 60.0, '增产': 2}, 
        {'原料': {'水': 2}, '产物': {'氢': 4, '氧': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'水': 2, '氯化钠': 2}, '产物': {'氢氧化钠': 2, '氢氯酸': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'海水': 4}, '产物': {'水': 4, '氯化钠': 1, '硝酸钠': 1, '硫酸钠': 1}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'丙烯': 1, '氢氯酸': 1, '氧': 2}, '产物': {'环氧氯丙烷': 1, '水': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'丙烯': 1, '苯': 2, '氧': 3}, '产物': {'双酚A': 1, '水': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硝酸钠': 2, '硫酸': 1}, '产物': {'硝酸': 2, '硫酸钠': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛合金': 2, '有机晶体': 1}, '产物': {'钛晶石': 2}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'氮': 3, '氢': 9}, '产物': {'氨': 3}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'苯': 2, '氨': 4}, '产物': {'二氨基联苯胺（DAB）': 1, '氢': 10}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 8}, '产物': {'煤焦油': 2}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤焦油': 1}, '产物': {'苯': 3}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛合金': 1, '环氧树脂': 1}, '产物': {'钛晶石': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'苯': 3, '二氧化碳': 2}, '产物': {'间苯二甲酸二苯酯': 1, '氢': 4}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'氢氯酸': 6, '铁块': 2, '氧': 3}, '产物': {'三氯化铁': 2, '水': 3}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'氨': 1, '氧': 4}, '产物': {'硝酸': 1, '水': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'二氧化碳': 1, '高能石墨': 1}, '产物': {'一氧化碳': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'一氧化碳': 3, '氢': 12}, '产物': {'丙烯': 1, '水': 3}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'生物基板': 2, '钛块': 2}, '产物': {'先进生物电路': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'活性生物纤维': 2, '钛块': 2}, '产物': {'生物神经纤维': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'钛合金': 50, '粒子宽带': 20, '量子芯片': 20}, '产物': {'超级纳米电脑': 1}, '设施': '高精度加工', '时间': 60.0, '增产': 3}, 
        {'原料': {'钨复合金属': 50, '生物神经纤维': 20, '先进生物电路': 20}, '产物': {'湿件主机': 1}, '设施': '高精度加工', '时间': 60.0, '增产': 3}, 
        {'原料': {'聚丙烯': 2, '硫酸': 1}, '产物': {'塑料基板': 1}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'聚苯并咪唑(PBI)': 2, '三氯化铁': 1}, '产物': {'生物基板': 1}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'双酚A': 1, '环氧氯丙烷': 1}, '产物': {'环氧树脂': 1, '氢氯酸': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'二氨基联苯胺（DAB）': 1, '间苯二甲酸二苯酯': 1}, '产物': {'聚苯并咪唑(PBI)': 1, '苯': 1}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛石': 10, '硝酸': 4}, '产物': {'钨矿': 1}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'钨矿': 2}, '产物': {'钨块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'玻璃': 2, '钨块': 1}, '产物': {'钨强化玻璃': 1}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛合金': 1, '钨块': 2}, '产物': {'钨复合金属': 1}, '设施': '冶炼设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'有机晶体': 2}, '产物': {'活性生物纤维': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'临界光子': 10}, '产物': {'光子结晶': 1}, '设施': '聚变生产', '时间': 60.0, '增产': 3}, 
        {'原料': {'铝块': 2, '齿轮': 2, '电路板': 1}, '产物': {'基础机械组件': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '钛块': 2, '处理器': 1}, '产物': {'先进机械组件': 1}, '设施': '标准制造', '时间': 4.0, '增产': 3}, 
        {'原料': {'先进机械组件': 2, '钨块': 2, '量子芯片': 1}, '产物': {'尖端机械组件': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'铝块': 1, '玻璃': 1}, '产物': {'空燃料棒': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'临界光子': 4}, '产物': {'反物质': 4}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '位面熔炉': 10, '量子芯片': 60}, '产物': {'物质裂解塔': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'活性生物纤维': 6}, '产物': {'聚苯并咪唑(PBI)': 1}, '设施': '精炼设备', '时间': 12.0, '增产': 3}, 
        {'原料': {'煤焦油': 1}, '产物': {'丙烯': 4}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铝矿': 2}, '产物': {'铝块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '铝块': 2}, '产物': {'铝合金': 2}, '设施': '冶炼设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'高能石墨': 1, '水': 1}, '产物': {'一氧化碳': 1, '氢': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高能石墨': 2, '氧': 4}, '产物': {'二氧化碳': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'丙烯': 2}, '产物': {'苯': 1}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'丙烯': 10, '氧': 6}, '产物': {'四氢双环戊二烯(JP-10)': 3, '水': 6}, '设施': '化工设备', '时间': 8.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '四氢双环戊二烯(JP-10)': 6, '氧': 10}, '产物': {'四氢双环戊二烯燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '煤焦油': 10, '氧': 10}, '产物': {'煤油燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'生物基板': 2, '钛块': 2}, '产物': {'处理器': 4}, '设施': '标准制造', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛合金': 16, '碳纳米管': 8, '量子芯片': 4, '钨强化玻璃': 4}, '产物': {'量子储液罐': 1}, '设施': '标准制造', '时间': 15.0, '增产': 3}, 
        {'原料': {'基础机械组件': 3, '钢材': 6}, '产物': {'矿物处理厂': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'铁矿': 2}, '产物': {'铁矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿': 2}, '产物': {'铜矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅石': 2}, '产物': {'硅矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛石': 2}, '产物': {'钛矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'石粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 2}, '产物': {'煤矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'放射性矿物': 4, '氢氧化钠': 4}, '产物': {'铀矿': 2, '钚矿': 1}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'铀矿': 2}, '产物': {'高纯铀块': 1}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'钚矿': 2}, '产物': {'高纯钚块': 1}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '高纯铀块': 4, '铝合金': 2}, '产物': {'铀燃料棒': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '高纯钚块': 4, '铝合金': 2}, '产物': {'钚燃料棒': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'钚燃料棒': 1, '铀燃料棒': 2, '超级磁场环': 2}, '产物': {'MOX燃料棒': 1}, '设施': '标准制造', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁矿粉': 2}, '产物': {'铁块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿粉': 2}, '产物': {'铜块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅矿粉': 2}, '产物': {'高纯硅块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛矿粉': 2}, '产物': {'钛块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铝矿粉': 2}, '产物': {'铝块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铝矿': 2}, '产物': {'铝矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'石粉': 2}, '产物': {'玻璃': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿粉': 2}, '产物': {'高能石墨': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 2, '石粉': 4, '煤矿粉': 1, '水': 2}, '产物': {'混凝土': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '基础制造台': 20, '量子芯片': 60}, '产物': {'天穹装配厂': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 30, '钨复合金属': 60, '混凝土': 360, '微型粒子对撞机': 10, '量子芯片': 120}, '产物': {'巨型粒子对撞机': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 10, '钛合金': 30, '钨强化玻璃': 10, '量子芯片': 10}, '产物': {'聚束液体汲取设施': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'基础机械组件': 10, '铝合金': 30, '混凝土': 20, '超级磁场环': 10}, '产物': {'大气采集站': 1}, '设施': '标准制造', '时间': 15.0, '增产': 3}, 
        {'原料': {}, '产物': {'剧毒液体': 1}, '设施': '垃圾回收', '时间': 180.0, '增产': 2}, 
        {'原料': {'煤矿粉': 4}, '产物': {'硫粉': 2}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'硫粉': 2, '水': 2, '氧': 6}, '产物': {'硫酸': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'电磁矩阵': 1, '能量矩阵': 1}, '产物': {'通量矩阵': 1}, '设施': '标准制造', '时间': 3.0, '增产': 2}, 
        {'原料': {'结构矩阵': 1, '信息矩阵': 1}, '产物': {'空间矩阵': 1}, '设施': '标准制造', '时间': 3.0, '增产': 2}, 
        {'原料': {'通量矩阵': 1, '空间矩阵': 1, '引力矩阵': 1}, '产物': {'宇宙矩阵粗坯': 1}, '设施': '标准制造', '时间': 3.0, '增产': 2}
    ],
        "proliferator_data": [
            {
                "增产剂名称": "不使用增产剂",
                "增产效果": 1,
                "加速效果": 1,
                "耗电倍率": 1,
                "喷涂次数": 1,
                "单次喷涂最高增产点数": 0
            },
            {
                "增产剂名称": "增产剂",
                "增产效果": 1.25,
                "加速效果": 2,
                "耗电倍率": 2.5,
                "喷涂次数": 60,
                "单次喷涂最高增产点数": 4
            }
        ],
        "proliferate_effect": [
            {
                "增产效果": 1.0,
                "加速效果": 1.0,
                "耗电倍率": 1.0,
            },
            {
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
            },
            {
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
            },
            {
                "增产效果": 1.225,
                "加速效果": 1.75,
                "耗电倍率": 2.1,
            },
            {
                "增产效果": 1.25,
                "加速效果": 2.0,
                "耗电倍率": 2.5,
            },
            {
                "增产效果": 1.275,
                "加速效果": 2.25,
                "耗电倍率": 2.9,
            },
            {
                "增产效果": 1.3,
                "加速效果": 2.5,
                "耗电倍率": 3.3,
            },
            {
                "增产效果": 1.325,
                "加速效果": 2.75,
                "耗电倍率": 3.7,
            },
            {
                "增产效果": 1.35,
                "加速效果": 3.0,
                "耗电倍率": 4.1,
            },
            {
                "增产效果": 1.375,
                "加速效果": 3.25,
                "耗电倍率": 4.5,
            },
            {
                "增产效果": 1.4,
                "加速效果": 3.5,
                "耗电倍率": 4.9,
            },
        ],
        "factory_data": {
            '行星大气': [
                { '名称': '大气采集站', '耗能': 0, '倍率': 4, '占地': 0.01 },
            ],
            '矿物处理': [
                { '名称': '矿物处理厂', '耗能': 0.72, '倍率': 2, '占地': 5.76 },
                { '名称': '物质裂解塔', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '垃圾回收': [
                { '名称': '物质分解设施', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '轻型工业机甲': [
                { '名称': '伊卡洛斯', '耗能': 0.08, '倍率': 1, '占地': 0.01 },
            ],
            '采矿设备': [
                { '名称': '采矿机', '耗能': 0.42, '倍率': 1, '占地': 15 },
                { '名称': '大型采矿机', '耗能': 2.94, '倍率': 2, '占地': 25 },
            ],
            '抽水设备': [
                { '名称': '抽水站', '耗能': 0.3, '倍率': 10 / 6, '占地': 12 },
                { '名称': '聚束液体汲取设施', '耗能': 30, '倍率': 1000, '占地': 12 },
            ],
            '抽油设备': [
                { '名称': '原油萃取站', '耗能': 0.84, '倍率': 2, '占地': 50 },
            ],
            '巨星采集': [
                { '名称': '轨道采集器', '耗能': 30, '倍率': 18, '占地': 0.01 },
            ],
            '射线接收站': [
                { '名称': '射线接收站', '耗能': 0, '倍率': 1, '占地': 54.82 },
            ],
            '冶炼设备': [
                { '名称': '电弧熔炉', '耗能': 0.72, '倍率': 2, '占地': 5.76 },
                { '名称': '位面熔炉', '耗能': 1.44, '倍率': 4, '占地': 5.76 },
                { '名称': '物质裂解塔', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '制造台': [
                { '名称': '制造台', '耗能': 0.54, '倍率': 2, '占地': 10.24 },
                { '名称': '天穹装配厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '标准制造': [
                { '名称': '标准制造单元', '耗能': 1.08, '倍率': 2, '占地': 10.24 },
                { '名称': '天穹装配厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '高精度加工': [
                { '名称': '高精度装配线', '耗能': 2.16, '倍率': 2, '占地': 10.24 },
                { '名称': '精密结构组装厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '精密组装': [
                { '名称': '精密制造厂', '耗能': 2400, '倍率': 1, '占地': 10.24 },
            ],
            '精炼设备': [
                { '名称': '精炼厂', '耗能': 0.96, '倍率': 4, '占地': 18 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 }
            ],
            '化工设备': [
                { '名称': '化工厂', '耗能': 0.72, '倍率': 4, '占地': 23.76 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 }
            ],
            '高分子化工': [
                { '名称': '先进化学反应釜', '耗能': 1.44, '倍率': 4, '占地': 23.76 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '粒子对撞机': [
                { '名称': '微型粒子对撞机', '耗能': 12, '倍率': 4, '占地': 45.12 },
                { '名称': '巨型粒子对撞机', '耗能': 60, '倍率': 40, '占地': 50 },
            ],
            '聚变生产': [
                { '名称': '紧凑式回旋加速器', '耗能': 4800, '倍率': 1, '占地': 45.12 },
            ],
            '科研设备': [
                { '名称': '矩阵研究站', '耗能': 0.48, '倍率': 1, '占地': 20.25 },
            ],
            '充电设备': [
                { '名称': '能量枢纽', '耗能': 600, '倍率': 200, '占地': 64 },
                { '名称': '蓄电器', '耗能': 9, '倍率': 3, '占地': 4 },
            ]

        }
    }
};