var GameData = {
    vanilla : {
        "recipe_data": [
            {
                "原料": {},
                "产物": {
                    "木材": 1
                },
                "设施": "轻型工业机甲",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "植物燃料": 1
                },
                "设施": "轻型工业机甲",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "铁矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "铜矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "石矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "煤矿": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "硅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "石矿": 10
                },
                "产物": {
                    "硅石": 1
                },
                "设施": "冶炼设备",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {},
                "产物": {
                    "钛石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "水": 1
                },
                "设施": "抽水设备",
                "时间": 1.2,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "原油": 1
                },
                "设施": "抽油设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "氢": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "重氢": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "氢": 10
                },
                "产物": {
                    "重氢": 5
                },
                "设施": "粒子对撞机",
                "时间": 2.5,
                "增产": 2
            },
            {
                "原料": {
                    "氢": 1
                },
                "产物": {
                    "重氢": 1
                },
                "设施": "分馏塔",
                "时间": 100,
                "增产": 2
            },
            {
                "原料": {
                    "临界光子": 2
                },
                "产物": {
                    "反物质": 2,
                    "氢": 2
                },
                "设施": "粒子对撞机",
                "时间": 2,
                "增产": 2
            },
            {
                "原料": {},
                "产物": {
                    "可燃冰": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "可燃冰": 1
                },
                "设施": "巨星采集",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "金伯利矿石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "分形硅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "光栅石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "有机晶体": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {
                    "塑料": 2,
                    "精炼油": 1,
                    "水": 1
                },
                "产物": {
                    "有机晶体": 1
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "木材": 20,
                    "植物燃料": 20,
                    "水": 10
                },
                "产物": {
                    "有机晶体": 1
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {},
                "产物": {
                    "刺笋结晶": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "单极磁石": 1
                },
                "设施": "采矿设备",
                "时间": 1,
                "增产": 0
            },
            {
                "原料": {},
                "产物": {
                    "临界光子": 1
                },
                "设施": "射线接收站",
                "时间": 10,
                "增产": 0
            },
            {
                "原料": {
                    "引力透镜": 0.008333
                },
                "产物": {
                    "临界光子": 1
                },
                "设施": "射线接收站",
                "时间": 5,
                "增产": 9
            },
            {
                "原料": {},
                "产物": {
                    "硫酸": 1
                },
                "设施": "抽水设备",
                "时间": 1.2,
                "增产": 0
            },
            {
                "原料": {
                    "精炼油": 6,
                    "石矿": 8,
                    "水": 4
                },
                "产物": {
                    "硫酸": 4
                },
                "设施": "化工设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁矿": 1
                },
                "产物": {
                    "铁块": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "铜矿": 1
                },
                "产物": {
                    "铜块": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "硅石": 2
                },
                "产物": {
                    "高纯硅块": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛石": 2
                },
                "产物": {
                    "钛块": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "石矿": 1
                },
                "产物": {
                    "石材": 1
                },
                "设施": "冶炼设备",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "煤矿": 2
                },
                "产物": {
                    "高能石墨": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 1,
                    "氢": 2
                },
                "产物": {
                    "高能石墨": 1,
                    "氢": 3
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "石矿": 2
                },
                "产物": {
                    "玻璃": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁矿": 1
                },
                "产物": {
                    "磁铁": 1
                },
                "设施": "冶炼设备",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "金伯利矿石": 1
                },
                "产物": {
                    "金刚石": 2
                },
                "设施": "冶炼设备",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "高能石墨": 1
                },
                "产物": {
                    "金刚石": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "分形硅石": 1
                },
                "产物": {
                    "晶格硅": 2
                },
                "设施": "制造台",
                "时间": 1.5,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 1
                },
                "产物": {
                    "晶格硅": 1
                },
                "设施": "冶炼设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 3
                },
                "产物": {
                    "钢材": 1
                },
                "设施": "冶炼设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "硫酸": 8,
                    "钛块": 4,
                    "钢材": 4
                },
                "产物": {
                    "钛合金": 4
                },
                "设施": "冶炼设备",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "原油": 2
                },
                "产物": {
                    "精炼油": 2,
                    "氢": 1
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 2,
                    "高能石墨": 1
                },
                "产物": {
                    "塑料": 1
                },
                "设施": "化工设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "硫酸": 1,
                    "高能石墨": 3
                },
                "产物": {
                    "石墨烯": 2
                },
                "设施": "化工设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "可燃冰": 2
                },
                "产物": {
                    "石墨烯": 2,
                    "氢": 1
                },
                "设施": "化工设备",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 1,
                    "石墨烯": 3
                },
                "产物": {
                    "碳纳米管": 2
                },
                "设施": "化工设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "刺笋结晶": 6
                },
                "产物": {
                    "碳纳米管": 2
                },
                "设施": "化工设备",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 1
                },
                "产物": {
                    "齿轮": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "玻璃": 3
                },
                "产物": {
                    "棱镜": 2
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "铜块": 1
                },
                "产物": {
                    "电路板": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "磁铁": 2,
                    "铜块": 1
                },
                "产物": {
                    "磁线圈": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 2,
                    "铜块": 1
                },
                "产物": {
                    "微晶元件": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 3,
                    "有机晶体": 1
                },
                "产物": {
                    "钛晶石": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 4,
                    "棱镜": 2
                },
                "产物": {
                    "电浆激发器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 1,
                    "铁块": 2,
                    "齿轮": 1
                },
                "产物": {
                    "电动机": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 2,
                    "电动机": 2
                },
                "产物": {
                    "电磁涡轮": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 2,
                    "微晶元件": 2
                },
                "产物": {
                    "处理器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 2,
                    "晶格硅": 2,
                    "塑料": 1
                },
                "产物": {
                    "粒子宽带": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 4,
                    "高纯硅块": 1,
                    "钛合金": 1
                },
                "产物": {
                    "框架材料": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 1,
                    "棱镜": 2
                },
                "产物": {
                    "光子合并器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电路板": 1,
                    "光栅石": 1
                },
                "产物": {
                    "光子合并器": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电磁涡轮": 2,
                    "铜块": 2,
                    "石墨烯": 2
                },
                "产物": {
                    "粒子容器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "单极磁石": 10,
                    "铜块": 2
                },
                "产物": {
                    "粒子容器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "电磁涡轮": 2,
                    "磁铁": 3,
                    "高能石墨": 1
                },
                "产物": {
                    "超级磁场环": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 4,
                    "奇异物质": 1
                },
                "产物": {
                    "引力透镜": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "玻璃": 2,
                    "钛块": 2,
                    "水": 2
                },
                "产物": {
                    "钛化玻璃": 2
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "钛晶石": 1,
                    "石墨烯": 2,
                    "氢": 12
                },
                "产物": {
                    "卡西米尔晶体": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "光栅石": 8,
                    "石墨烯": 2,
                    "氢": 12
                },
                "产物": {
                    "卡西米尔晶体": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "卡西米尔晶体": 1,
                    "钛化玻璃": 2
                },
                "产物": {
                    "位面过滤器": 1
                },
                "设施": "制造台",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 2,
                    "位面过滤器": 2
                },
                "产物": {
                    "量子芯片": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 1,
                    "粒子容器": 1
                },
                "产物": {
                    "湮灭约束球": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "粒子容器": 2,
                    "重氢": 10
                },
                "产物": {
                    "奇异物质": 1
                },
                "设施": "粒子对撞机",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "煤矿": 1
                },
                "产物": {
                    "增产剂MK.Ⅰ": 1
                },
                "设施": "制造台",
                "时间": 0.5,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 1,
                    "增产剂MK.Ⅰ": 2
                },
                "产物": {
                    "增产剂MK.Ⅱ": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "碳纳米管": 1,
                    "增产剂MK.Ⅱ": 2
                },
                "产物": {
                    "增产剂MK.Ⅲ": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 1,
                    "氢": 10
                },
                "产物": {
                    "液氢燃料棒": 2
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 1,
                    "重氢": 20,
                    "超级磁场环": 1
                },
                "产物": {
                    "氘核燃料棒": 2
                },
                "设施": "制造台",
                "时间": 12,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 1,
                    "氢": 12,
                    "反物质": 12,
                    "湮灭约束球": 1
                },
                "产物": {
                    "反物质燃料棒": 2
                },
                "设施": "制造台",
                "时间": 24,
                "增产": 2
            },
            {
                "原料": {
                    "引力透镜": 1
                },
                "产物": {
                    "空间翘曲器": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "引力矩阵": 1
                },
                "产物": {
                    "空间翘曲器": 8
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "石墨烯": 1,
                    "光子合并器": 1
                },
                "产物": {
                    "太阳帆": 2
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "框架材料": 3,
                    "处理器": 3,
                    "太阳帆": 3
                },
                "产物": {
                    "戴森球组件": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "量子芯片": 2,
                    "氘核燃料棒": 4,
                    "戴森球组件": 2
                },
                "产物": {
                    "小型运载火箭": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "磁线圈": 1,
                    "电路板": 1
                },
                "产物": {
                    "电磁矩阵": 1
                },
                "设施": "科研设备",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "高能石墨": 2,
                    "氢": 2
                },
                "产物": {
                    "能量矩阵": 1
                },
                "设施": "科研设备",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "金刚石": 1,
                    "钛晶石": 1
                },
                "产物": {
                    "结构矩阵": 1
                },
                "设施": "科研设备",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 2,
                    "粒子宽带": 1
                },
                "产物": {
                    "信息矩阵": 1
                },
                "设施": "科研设备",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "引力透镜": 1,
                    "量子芯片": 1
                },
                "产物": {
                    "引力矩阵": 2
                },
                "设施": "科研设备",
                "时间": 24,
                "增产": 3
            },
            {
                "原料": {
                    "电磁矩阵": 1,
                    "能量矩阵": 1,
                    "结构矩阵": 1,
                    "信息矩阵": 1,
                    "引力矩阵": 1,
                    "反物质": 1
                },
                "产物": {
                    "宇宙矩阵": 1
                },
                "设施": "科研设备",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 2,
                    "铜块": 3
                },
                "产物": {
                    "推进器": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 5,
                    "电磁涡轮": 5
                },
                "产物": {
                    "加力推进器": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 5,
                    "处理器": 2,
                    "推进器": 2
                },
                "产物": {
                    "物流运输机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "钛合金": 10,
                    "处理器": 10,
                    "加力推进器": 2
                },
                "产物": {
                    "星际物流运输船": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 2
            },
            {
                "原料": {
                    "钢材": 1,
                    "石材": 3
                },
                "产物": {
                    "地基": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "磁线圈": 1
                },
                "产物": {
                    "电力感应塔": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "电力感应塔": 1,
                    "电浆激发器": 3
                },
                "产物": {
                    "无线输电塔": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 2
            },
            {
                "原料": {
                    "无线输电塔": 1,
                    "超级磁场环": 10,
                    "框架材料": 2
                },
                "产物": {
                    "卫星配电站": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 6,
                    "齿轮": 1,
                    "磁线圈": 3
                },
                "产物": {
                    "风力涡轮机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 10,
                    "石材": 4,
                    "齿轮": 4,
                    "磁线圈": 4
                },
                "产物": {
                    "火力发电机": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "高纯硅块": 10,
                    "铜块": 10,
                    "电路板": 5
                },
                "产物": {
                    "太阳能板": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 6,
                    "超级磁场环": 1,
                    "晶格硅": 6
                },
                "产物": {
                    "蓄电器": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "蓄电器": 1
                },
                "产物": {
                    "蓄电器（满）": 1
                },
                "设施": "充电设备",
                "时间": 300,
                "增产": 0
            },
            {
                "原料": {
                    "钢材": 15,
                    "超级磁场环": 1,
                    "铜块": 20,
                    "光子合并器": 4
                },
                "产物": {
                    "地热发电站": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 12,
                    "超级磁场环": 10,
                    "碳纳米管": 8,
                    "处理器": 4
                },
                "产物": {
                    "微型聚变发电站": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 40,
                    "钛合金": 40,
                    "处理器": 40,
                    "粒子容器": 8
                },
                "产物": {
                    "能量枢纽": 1
                },
                "设施": "制造台",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 20,
                    "高纯硅块": 20,
                    "处理器": 5,
                    "光子合并器": 10,
                    "超级磁场环": 20
                },
                "产物": {
                    "射线接收站": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "框架材料": 20,
                    "湮灭约束球": 10,
                    "量子芯片": 10
                },
                "产物": {
                    "人造恒星": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 2,
                    "齿轮": 1
                },
                "产物": {
                    "传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "传送带": 3,
                    "电磁涡轮": 1
                },
                "产物": {
                    "高速传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "高速传送带": 3,
                    "超级磁场环": 1,
                    "石墨烯": 1
                },
                "产物": {
                    "极速传送带": 3
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 3,
                    "齿轮": 2,
                    "电路板": 1
                },
                "产物": {
                    "四向分流器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 3,
                    "超级磁场环": 1,
                    "齿轮": 4,
                    "处理器": 2
                },
                "产物": {
                    "自动集装机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 3,
                    "电路板": 2,
                    "齿轮": 2,
                    "玻璃": 1
                },
                "产物": {
                    "流速监测器": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 4,
                    "石材": 4
                },
                "产物": {
                    "小型储物仓": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "石材": 8
                },
                "产物": {
                    "大型储物仓": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "石材": 4,
                    "玻璃": 4
                },
                "产物": {
                    "储液罐": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "钛块": 40,
                    "钢材": 40,
                    "处理器": 40,
                    "粒子容器": 20
                },
                "产物": {
                    "行星内物流运输站": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 40,
                    "粒子容器": 20,
                    "行星内物流运输站": 1
                },
                "产物": {
                    "星际物流运输站": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 2
            },
            {
                "原料": {
                    "超级磁场环": 50,
                    "加力推进器": 20,
                    "蓄电器（满）": 20,
                    "星际物流运输站": 1
                },
                "产物": {
                    "轨道采集器": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 1,
                    "电路板": 1
                },
                "产物": {
                    "分拣器": 1
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 3
            },
            {
                "原料": {
                    "分拣器": 2,
                    "电动机": 1
                },
                "产物": {
                    "高速分拣器": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "高速分拣器": 2,
                    "电磁涡轮": 1
                },
                "产物": {
                    "极速分拣器": 2
                },
                "设施": "制造台",
                "时间": 1,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 4,
                    "电路板": 2,
                    "磁线圈": 2,
                    "齿轮": 2
                },
                "产物": {
                    "采矿机": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "框架材料": 10,
                    "超级磁场环": 10,
                    "量子芯片": 2,
                    "光栅石": 40
                },
                "产物": {
                    "大型采矿机": 1
                },
                "设施": "制造台",
                "时间": 20,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "电路板": 2,
                    "电动机": 4,
                    "石材": 4
                },
                "产物": {
                    "抽水机": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 12,
                    "电路板": 6,
                    "石材": 12,
                    "电浆激发器": 4
                },
                "产物": {
                    "原油萃取站": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 10,
                    "电路板": 6,
                    "石材": 10,
                    "电浆激发器": 6
                },
                "产物": {
                    "原油精炼厂": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "处理器": 1,
                    "石材": 4,
                    "玻璃": 4
                },
                "产物": {
                    "分馏塔": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 20,
                    "处理器": 8,
                    "框架材料": 20,
                    "超级磁场环": 50,
                    "石墨烯": 10
                },
                "产物": {
                    "微型粒子对撞机": 1
                },
                "设施": "制造台",
                "时间": 15,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 20,
                    "处理器": 5,
                    "齿轮": 20,
                    "超级磁场环": 10
                },
                "产物": {
                    "电磁轨道弹射器": 1
                },
                "设施": "制造台",
                "时间": 6,
                "增产": 3
            },
            {
                "原料": {
                    "钛合金": 80,
                    "框架材料": 30,
                    "引力透镜": 20,
                    "量子芯片": 10
                },
                "产物": {
                    "垂直发射井": 1
                },
                "设施": "制造台",
                "时间": 30,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 4,
                    "齿轮": 8,
                    "电路板": 4
                },
                "产物": {
                    "制造台MK.Ⅰ": 1
                },
                "设施": "制造台",
                "时间": 0.5,
                "增产": 3
            },
            {
                "原料": {
                    "处理器": 4,
                    "石墨烯": 8,
                    "制造台MK.Ⅰ": 1
                },
                "产物": {
                    "制造台MK.Ⅱ": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 2
            },
            {
                "原料": {
                    "量子芯片": 2,
                    "粒子宽带": 8,
                    "制造台MK.Ⅱ": 1
                },
                "产物": {
                    "制造台MK.Ⅲ": 1
                },
                "设施": "制造台",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 4,
                    "电路板": 4,
                    "磁线圈": 2,
                    "石材": 2
                },
                "产物": {
                    "电弧熔炉": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "电弧熔炉": 1,
                    "框架材料": 5,
                    "位面过滤器": 4,
                    "单极磁石": 15
                },
                "产物": {
                    "位面熔炉": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 2
            },
            {
                "原料": {
                    "钢材": 4,
                    "电浆激发器": 2,
                    "电路板": 2,
                    "微晶元件": 2
                },
                "产物": {
                    "喷涂机": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "钢材": 8,
                    "石材": 8,
                    "电路板": 2,
                    "玻璃": 8
                },
                "产物": {
                    "化工厂": 1
                },
                "设施": "制造台",
                "时间": 5,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "玻璃": 4,
                    "电路板": 4,
                    "磁线圈": 4
                },
                "产物": {
                    "研究站": 1
                },
                "设施": "制造台",
                "时间": 3,
                "增产": 3
            },
            {
                "原料": {
                    "精炼油": 2,
                    "氢": 1,
                    "煤矿": 1
                },
                "产物": {
                    "精炼油": 3
                },
                "设施": "精炼设备",
                "时间": 4,
                "增产": 2
            },
            {
                "原料": {
                    "铁块": 2,
                    "处理器": 1,
                    "电磁涡轮": 1
                },
                "产物": {
                    "配送运输机": 1
                },
                "设施": "制造台",
                "时间": 2,
                "增产": 3
            },
            {
                "原料": {
                    "铁块": 8,
                    "处理器": 4,
                    "电浆激发器": 4
                },
                "产物": {
                    "物流配送器": 1
                },
                "设施": "制造台",
                "时间": 8,
                "增产": 3
            },
            {
                "原料": {
                    "化工厂": 1,
                    "钛化玻璃": 10,
                    "奇异物质": 3,
                    "量子芯片": 3
                },
                "产物": {
                    "量子化工厂": 1
                },
                "设施": "制造台",
                "时间": 10,
                "增产": 2
            }
        ],
        "proliferator_data": [
            {
                "增产剂名称": "不使用增产剂",
                "增产效果": 1,
                "加速效果": 1,
                "耗电倍率": 1,
                "喷涂次数": 1,
                "单次喷涂最高增产点数":0
            },
            {
                "增产剂名称": "增产剂MK.Ⅰ",
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
                "喷涂次数": 12,
                "单次喷涂最高增产点数":1
            },
            {
                "增产剂名称": "增产剂MK.Ⅱ",
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
                "喷涂次数": 24,
                "单次喷涂最高增产点数":2
            },
            {
                "增产剂名称": "增产剂MK.Ⅲ",
                "增产效果": 1.25,
                "加速效果": 2,
                "耗电倍率": 2.5,
                "喷涂次数": 60,
                "单次喷涂最高增产点数":4
            }
        ],
        "proliferate_effect": [
            {
                "增产效果": 1.0,
                "加速效果": 1.0,
                "耗电倍率": 1.0,
            },
            {
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
            },
            {
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
            },
            {
                "增产效果": 1.225,
                "加速效果": 1.75,
                "耗电倍率": 2.1,
            },
            {
                "增产效果": 1.25,
                "加速效果": 2.0,
                "耗电倍率": 2.5,
            },
            {
                "增产效果": 1.275,
                "加速效果": 2.25,
                "耗电倍率": 2.9,
            },
            {
                "增产效果": 1.3,
                "加速效果": 2.5,
                "耗电倍率": 3.3,
            },
            {
                "增产效果": 1.325,
                "加速效果": 2.75,
                "耗电倍率": 3.7,
            },
            {
                "增产效果": 1.35,
                "加速效果": 3.0,
                "耗电倍率": 4.1,
            },
            {
                "增产效果": 1.375,
                "加速效果": 3.25,
                "耗电倍率": 4.5,
            },
            {
                "增产效果": 1.4,
                "加速效果": 3.5,
                "耗电倍率": 4.9,
            },
        ],
        "factory_data": {
            "轻型工业机甲": [
                {
                    "名称": "伊卡洛斯",
                    "耗能": 0.08,
                    "倍率": 1,
                    "占地": 0
                }
            ],
            "采矿设备": [
                {
                    "名称": "采矿机",
                    "耗能": 0.42,
                    "倍率": 0.5,
                    "占地": 15
                },
                {
                    "名称": "大型采矿机",
                    "耗能": 2.94,
                    "倍率": 1,
                    "占地": 25
                }
            ],
            "抽水设备": [
                {
                    "名称": "抽水机",
                    "耗能": 0.3,
                    "倍率": 1,
                    "占地": 12
                }
            ],
            "抽油设备": [
                {
                    "名称": "原油萃取站",
                    "耗能": 0.3,
                    "倍率": 1,
                    "占地": 50
                }
            ],
            "巨星采集": [
                {
                    "名称": "轨道采集器",
                    "耗能": 30,
                    "倍率": 8,
                    "占地": 0
                }
            ],
            "射线接收站": [
                {
                    "名称": "射线接收站",
                    "耗能": 0,
                    "倍率": 1,
                    "占地": 54.82
                }
            ],
            "冶炼设备": [
                {
                    "名称": "电弧熔炉",
                    "耗能": 0.36,
                    "倍率": 1,
                    "占地": 5.76
                },
                {
                    "名称": "位面熔炉",
                    "耗能": 1.44,
                    "倍率": 2,
                    "占地": 5.76
                }
            ],
            "制造台": [
                {
                    "名称": "制造台MK.Ⅰ",
                    "耗能": 0.27,
                    "倍率": 0.75,
                    "占地": 10.24
                },
                {
                    "名称": "制造台MK.Ⅱ",
                    "耗能": 0.54,
                    "倍率": 1,
                    "占地": 10.24
                },
                {
                    "名称": "制造台MK.Ⅲ",
                    "耗能": 1.08,
                    "倍率": 1.5,
                    "占地": 10.24
                }
            ],
            "精炼设备": [
                {
                    "名称": "原油精炼厂",
                    "耗能": 0.96,
                    "倍率": 1,
                    "占地": 18
                }
            ],
            "化工设备": [
                {
                    "名称": "化工厂",
                    "耗能": 0.72,
                    "倍率": 1,
                    "占地": 23.76
                },
                {
                    "名称": "量子化工厂",
                    "耗能": 2.16,
                    "倍率": 2,
                    "占地": 23.76
                }
            ],
            "分馏设备": [
                {
                    "名称": "分馏塔",
                    "耗能": 0.72,
                    "倍率": 1,
                    "占地": 12.96
                }
            ],
            "粒子对撞机": [
                {
                    "名称": "微型粒子对撞机",
                    "耗能": 12,
                    "倍率": 1,
                    "占地": 45.12
                }
            ],
            "科研设备": [
                {
                    "名称": "研究站",
                    "耗能": 0.48,
                    "倍率": 1,
                    "占地": 20.25
                }
            ],
            "充电设备": [
                {
                    "名称": "能量枢纽",
                    "耗能": 45,
                    "倍率": 50,
                    "占地": 64
                },
                {
                    "名称": "蓄电器",
                    "耗能": 0.9,
                    "倍率": 1,
                    "占地": 4
                }
            ]
        }
    },
    GenesisBook : {
        "recipe_data": [{'原料': {}, '产物': {'水': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'铁矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'铜矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'硅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'钛石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'石矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'煤矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'原油': 1}, '设施': '抽油设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'可燃冰': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'金伯利矿石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'分形硅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'光栅石': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'刺笋结晶': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'钨矿': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'木材': 1}, '设施': '轻型工业机甲', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'植物燃料': 1}, '设施': '轻型工业机甲', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'剧毒液体': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'有机晶体': 1}, '设施': '采矿设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氢': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'重氢': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'临界光子': 1}, '设施': '射线接收站', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'蓄电器（满）': 1}, '设施': '充电设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'一氧化碳': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'二氧化碳': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氮': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氦': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氨': 1}, '设施': '巨星采集', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'盐水': 1}, '设施': '抽水设备', '时间': 1, '增产': 0}, 
        {'原料': {}, '产物': {'氧': 1}, '设施': '行星大气', '时间': 1, '增产': 0}, 
        {'原料': {'铁矿': 2}, '产物': {'铁块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜块': 4}, '产物': {'铜线圈': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿': 2}, '产物': {'铜块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'石材': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2}, '产物': {'齿轮': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '铜块': 2}, '产物': {'电路板': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 4, '电动机': 1}, '产物': {'风力涡轮机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '铜线圈': 2}, '产物': {'电力感应塔': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜线圈': 1, '电路板': 1}, '产物': {'电磁矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 4, '玻璃': 2, '电路板': 2}, '产物': {'矩阵研究站': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'三元精金': 40, '光子结晶': 20, '湿件主机': 10}, '产物': {'先驱者晶片': 1}, '设施': '精密组装', '时间': 90.0, '增产': 3}, 
        {'原料': {'玻璃': 1, '铜线圈': 2}, '产物': {'电浆激发器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'电力感应塔': 1, '电浆激发器': 1}, '产物': {'无线输电塔': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 4, '钢材': 12, '电浆激发器': 4, '电路板': 4}, '产物': {'原油萃取站': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'基础机械组件': 4, '钢材': 6, '电浆激发器': 4, '电路板': 2}, '产物': {'精炼厂': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'原油': 2}, '产物': {'氢': 2, '煤焦油': 1}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 2}, '产物': {'高能石墨': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高能石墨': 1, '氢': 1}, '产物': {'能量矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '氢燃料': 1, '氧': 10}, '产物': {'氢燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'钢材': 1, '电磁涡轮': 1}, '产物': {'推进器2': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'推进器2': 2, '钛合金': 1, '超级磁场环': 1}, '产物': {'加力推进器': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '铁块': 4, '玻璃': 4, '电路板': 2}, '产物': {'化工厂': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'乙烯': 2, '氧': 2}, '产物': {'聚乙烯': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硫酸钠': 2, '水': 4}, '产物': {'硫酸': 2, '氢氧化钠': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高精度装配线': 60, '极速传送带': 240, '钨复合金属': 120, '超生物计算集群': 60}, '产物': {'精密制造厂': 1}, '设施': '高精度加工', '时间': 180.0, '增产': 3}, 
        {'原料': {'微型粒子对撞机': 40, '框架材料': 240, '超级磁场环': 120, '湿件主机': 5}, '产物': {'紧凑式回旋加速器': 1}, '设施': '高精度加工', '时间': 180.0, '增产': 3}, 
        {'原料': {'钛块': 1, '晶格硅': 1}, '产物': {'结构矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'超级磁场环': 1, '石墨烯': 1, '氢': 2}, '产物': {'卡西米尔晶体': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '位面熔炉': 10, '量子芯片': 60}, '产物': {'物质裂解塔': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'玻璃': 2, '钛块': 1}, '产物': {'钛化玻璃': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'高能石墨': 4, '硫酸': 1}, '产物': {'石墨烯': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'可燃冰': 2}, '产物': {'石墨烯': 2, '氢': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石墨烯': 4}, '产物': {'碳纳米管': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 4}, '产物': {'硅石': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'刺笋结晶': 2}, '产物': {'碳纳米管': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'碳纳米管': 1, '钛化玻璃': 1}, '产物': {'粒子宽带': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'高纯硅块': 1}, '产物': {'晶格硅': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'卡西米尔晶体': 1, '钛化玻璃': 2}, '产物': {'位面过滤器': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '钛合金': 20, '超级磁场环': 20, '量子芯片': 5}, '产物': {'微型粒子对撞机': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'氢': 4}, '产物': {'重氢': 2}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'空燃料棒': 1, '氘核燃料': 1}, '产物': {'氘核燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'三元精金': 20, '反物质约束单元': 12, '超生物计算集群': 4}, '产物': {'湮灭约束球': 1}, '设施': '精密组装', '时间': 60.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 40, '钨复合金属': 60, '氦闪约束器': 16, '超级纳米电脑': 1}, '产物': {'人造恒星': 1}, '设施': '高精度加工', '时间': 30.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '反物质燃料': 1}, '产物': {'反物质燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 2}, 
        {'原料': {'基础机械组件': 2, '低速分拣器': 2, '电路板': 2}, '产物': {'制造台': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '玻璃': 1, '电路板': 1}, '产物': {'电路蚀刻机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 6, '钛合金': 10, '极速分拣器': 12, '处理器': 6}, '产物': {'高精度装配线': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 2, '齿轮': 2}, '产物': {'采矿机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '铁块': 4, '电动机': 2}, '产物': {'抽水站': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'玻璃': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'覆层塑料基板': 2, '微晶元件': 2, '低功率IC晶片': 2}, '产物': {'处理器': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'钛蚀刻覆层塑料基板': 2, '处理器': 2, '标准功率IC晶片': 2}, '产物': {'量子芯片': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'塑料基板': 2, '电路板': 2, '超低功率IC晶片': 2}, '产物': {'微晶元件': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '先进化学反应釜': 10, '量子芯片': 60}, '产物': {'巨型化学反应釜': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'卡西米尔晶体': 1, '粒子宽带': 1}, '产物': {'信息矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '铁块': 2, '铜线圈': 2}, '产物': {'电弧熔炉': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 10, '钛合金': 10, '钨复合金属': 10}, '产物': {'三元精金': 1}, '设施': '聚变生产', '时间': 60.0, '增产': 3}, 
        {'原料': {'煤焦油': 1, '氢': 2}, '产物': {'氢': 3, '高能石墨': 1}, '设施': '精炼设备', '时间': 2.0, '增产': 2}, 
        {'原料': {'硅石': 2}, '产物': {'高纯硅块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高能石墨': 1}, '产物': {'金刚石': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'金伯利矿石': 2}, '产物': {'金刚石': 4}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'分形硅石': 2}, '产物': {'晶格硅': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2}, '产物': {'钢材': 1}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 10, '石材': 10, '电动机': 4, '电路板': 4}, '产物': {'火力发电厂': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'钛石': 2}, '产物': {'钛块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 4, '钛块': 4}, '产物': {'钛合金': 4}, '设施': '冶炼设备', '时间': 6.0, '增产': 3}, 
        {'原料': {'铁块': 4, '高纯硅块': 2, '电路板': 1}, '产物': {'太阳能板': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 30, '钨复合金属': 60, '混凝土': 360, '高精度装配线': 20, '量子芯片': 120}, '产物': {'精密结构组装厂': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'先进机械组件': 20, '钛合金': 60, '混凝土': 40, '矿物处理厂': 20, '量子芯片': 10}, '产物': {'物质分解设施': 1}, '设施': '高精度加工', '时间': 120.0, '增产': 3}, 
        {'原料': {'聚苯并咪唑(PBI)': 1, '处理器': 1}, '产物': {'太阳帆': 6}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 20, '钨复合金属': 40, '超级磁场环': 20, '超级纳米电脑': 2}, '产物': {'电磁轨道弹射器': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 2, '钨复合金属': 10, '太阳帆': 6, '量子芯片': 2}, '产物': {'射线接收站': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'三元精金': 120, '尖端机械组件': 60, '光子结晶': 60, '先驱者晶片': 4}, '产物': {'广播式能源塔': 1}, '设施': '精密组装', '时间': 180.0, '增产': 3}, 
        {'原料': {'临界光子': 2}, '产物': {'反物质': 2, '氢': 2}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'宇宙矩阵粗坯': 1, '反物质': 1}, '产物': {'宇宙矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'铁块': 4, '晶格硅': 2, '电路板': 1}, '产物': {'蓄电器': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'先进机械组件': 4, '混凝土': 16, '处理器': 4}, '产物': {'能量枢纽': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'引力透镜': 1}, '产物': {'空间翘曲器': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'引力矩阵': 1}, '产物': {'空间翘曲器': 8}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'钨复合金属': 1, '聚苯并咪唑(PBI)': 1}, '产物': {'框架材料': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'框架材料': 1, '太阳帆': 1}, '产物': {'戴森球组件': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 20, '钨复合金属': 40, '钨强化玻璃': 20, '超级纳米电脑': 8}, '产物': {'垂直发射井': 1}, '设施': '高精度加工', '时间': 15.0, '增产': 3}, 
        {'原料': {'戴森球组件': 4, '量子芯片': 1, '加力推进器': 2}, '产物': {'小型运载火箭': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁块': 2, '电动机': 2}, '产物': {'低速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '电动机': 2}, '产物': {'低速分拣器': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '石材': 2}, '产物': {'小型储物仓': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 1, '低速传送带': 1}, '产物': {'四向分流器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'低速分拣器': 4, '电磁涡轮': 2}, '产物': {'高速分拣器': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'低速传送带': 6, '电磁涡轮': 2}, '产物': {'高速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'高速分拣器': 4, '超级磁场环': 2}, '产物': {'极速分拣器': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 4, '石材': 4}, '产物': {'大型储物仓': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'高速传送带': 6, '超级磁场环': 2}, '产物': {'极速传送带': 6}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 10, '钢材': 30, '混凝土': 20, '微晶元件': 5}, '产物': {'物流运输站': 1}, '设施': '制造台', '时间': 15.0, '增产': 3}, 
        {'原料': {'铁块': 4, '推进器2': 2}, '产物': {'物流运输机': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'先进机械组件': 20, '钛合金': 60, '混凝土': 40, '处理器': 2}, '产物': {'星际物流运输站': 1}, '设施': '制造台', '时间': 30.0, '增产': 3}, 
        {'原料': {'钛合金': 8, '加力推进器': 2}, '产物': {'星际物流运输船': 1}, '设施': '制造台', '时间': 15.0, '增产': 3}, 
        {'原料': {'铁块': 1, '铜线圈': 1}, '产物': {'电动机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'电动机': 1, '石墨线圈': 1}, '产物': {'电磁涡轮': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'氘核燃料棒': 1, '氦三燃料棒': 1, '氦闪约束器': 1}, '产物': {'氘氦混合聚变燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '氦三': 20}, '产物': {'氦三燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'超级磁场环': 1, '奇异物质': 1}, '产物': {'引力透镜': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'引力透镜': 1, '位面过滤器': 1}, '产物': {'引力矩阵': 1}, '设施': '科研设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'电磁涡轮': 1, '钛线圈': 1}, '产物': {'超级磁场环': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'卡西米尔晶体': 1, '重氢': 8}, '产物': {'奇异物质': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'氦': 4}, '产物': {'氦三': 1}, '设施': '粒子对撞机', '时间': 4.0, '增产': 3}, 
        {'原料': {'光栅石': 2}, '产物': {'氦': 4}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'碳纳米管': 2, '三氯化铁': 1}, '产物': {'增产剂': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '混凝土': 10, '钛化玻璃': 4, '量子芯片': 2}, '产物': {'喷涂机': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'三元精金': 240, '尖端机械组件': 120, '湮灭约束球': 120, '先驱者晶片': 8}, '产物': {'反物质能量炉': 1}, '设施': '精密组装', '时间': 180.0, '增产': 3}, 
        {'原料': {'星际物流运输站': 1, '超级磁场环': 20}, '产物': {'轨道采集器': 1}, '设施': '制造台', '时间': 30.0, '增产': 3}, 
        {'原料': {'石材': 2, '钢材': 2}, '产物': {'地基': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 10, '钛合金': 30, '混凝土': 20, '超级磁场环': 16, '量子芯片': 4}, '产物': {'裂变能源发电站': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁块': 2, '石材': 2, '玻璃': 2}, '产物': {'储液罐': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钨复合金属': 8, '超级磁场环': 4, '量子芯片': 1}, '产物': {'氦闪约束器': 1}, '设施': '高精度加工', '时间': 15.0, '增产': 3}, 
        {'原料': {'先进机械组件': 4, '钛合金': 8, '位面过滤器': 4}, '产物': {'位面熔炉': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'铁块': 1, '电路板': 1}, '产物': {'流速监测器': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'火力发电厂': 2, '钛合金': 16, '处理器': 4}, '产物': {'地热发电站': 1}, '设施': '制造台', '时间': 6.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 20, '钛合金': 60, '钨强化玻璃': 20, '量子芯片': 10}, '产物': {'大型采矿机': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '低速传送带': 2, '电路板': 2}, '产物': {'自动集装机': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'框架材料': 8, '位面过滤器': 4, '超级磁场环': 4, '量子芯片': 2}, '产物': {'反物质约束单元': 1}, '设施': '高精度加工', '时间': 30.0, '增产': 3}, 
        {'原料': {'基础机械组件': 1, '钢材': 2, '电路板': 1}, '产物': {'物流配送器': 1}, '设施': '制造台', '时间': 8.0, '增产': 3}, 
        {'原料': {'铁块': 2, '电磁涡轮': 1, '电路板': 1}, '产物': {'配送运输机': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 2, '钛化玻璃': 12, '钛合金': 12, '处理器': 6}, '产物': {'先进化学反应釜': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'原油': 3}, '产物': {'乙烯': 3, '氯苯': 2, '甘油': 1}, '设施': '精炼设备', '时间': 6.0, '增产': 3}, 
        {'原料': {'水': 2}, '产物': {'氢': 4, '氧': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'盐水': 2}, '产物': {'氢氧化钠': 2, '氢氯酸': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 1}, '产物': {'氯化钠': 1, '硝酸钠': 1, '硫酸钠': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'甘油': 1, '氢氯酸': 1}, '产物': {'环氧氯丙烷': 1, '水': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'水': 2, '氯化钠': 2}, '产物': {'盐水': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'氢氯酸': 1, '苯酚': 2, '丙酮': 1}, '产物': {'双酚A': 1, '水': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硝酸钠': 2, '硫酸': 1}, '产物': {'硝酸': 2, '硫酸钠': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硝酸': 2, '氯苯': 2}, '产物': {'二硝基氯苯': 2}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'二硝基氯苯': 2, '铜块': 2}, '产物': {'二氯联苯胺': 2}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'氮': 1, '氢': 3}, '产物': {'氨': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'二氯联苯胺': 1, '氨': 2}, '产物': {'二氨基联苯胺': 1, '氢氯酸': 2}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 2}, '产物': {'煤焦油': 2}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤焦油': 2}, '产物': {'苯酚': 4, '二甲苯': 2, '丙酮': 2}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'氧': 2, '二甲苯': 1}, '产物': {'邻苯二甲酸': 1, '水': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'苯酚': 4, '邻苯二甲酸': 2}, '产物': {'间苯二甲酸二苯酯': 2}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'氢氯酸': 12, '铁块': 4, '氧': 6}, '产物': {'三氯化铁': 4, '水': 6}, '设施': '化工设备', '时间': 6.0, '增产': 3}, 
        {'原料': {'氨': 1, '氧': 4}, '产物': {'硝酸': 1, '水': 1}, '设施': '化工设备', '时间': 6.0, '增产': 3}, 
        {'原料': {'二氧化碳': 1, '高能石墨': 1}, '产物': {'一氧化碳': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'二氧化碳': 12, '氢': 36}, '产物': {'原油': 1}, '设施': '化工设备', '时间': 12.0, '增产': 3}, 
        {'原料': {'一氧化碳': 3, '氢': 8}, '产物': {'甘油': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'生物基板': 2, '微晶元件': 2, '高功率IC晶片': 2}, '产物': {'生物微晶元件': 1}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'覆层生物基板': 2, '生物微晶元件': 2, '超高功率IC晶片': 2}, '产物': {'先进生物电路': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'钨蚀刻覆层生物基板': 2, '先进生物电路': 2, '生物IC晶片': 2}, '产物': {'超生物计算集群': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'粒子宽带': 2, '活性生物纤维': 2, '钨强化玻璃': 2}, '产物': {'生物神经纤维': 1}, '设施': '高精度加工', '时间': 4.0, '增产': 3}, 
        {'原料': {'钛合金': 50, '粒子宽带': 20, '量子芯片': 20}, '产物': {'超级纳米电脑': 1}, '设施': '高精度加工', '时间': 60.0, '增产': 3}, 
        {'原料': {'钨复合金属': 60, '生物神经纤维': 40, '超生物计算集群': 40}, '产物': {'湿件主机': 1}, '设施': '高精度加工', '时间': 90.0, '增产': 3}, 
        {'原料': {'聚乙烯': 1, '硫酸': 1}, '产物': {'塑料基板': 1}, '设施': '电路蚀刻', '时间': 2.0, '增产': 3}, 
        {'原料': {'塑料基板': 1, '环氧树脂': 2, '硫酸': 1}, '产物': {'覆层塑料基板': 1}, '设施': '电路蚀刻', '时间': 2.0, '增产': 3}, 
        {'原料': {'覆层塑料基板': 1, '钛块': 2, '硫酸': 1}, '产物': {'钛蚀刻覆层塑料基板': 1}, '设施': '电路蚀刻', '时间': 2.0, '增产': 3}, 
        {'原料': {'聚苯并咪唑(PBI)': 2, '三氯化铁': 2}, '产物': {'生物基板': 1}, '设施': '电路蚀刻', '时间': 4.0, '增产': 3}, 
        {'原料': {'生物基板': 1, '活性生物纤维': 2, '三氯化铁': 2}, '产物': {'覆层生物基板': 1}, '设施': '电路蚀刻', '时间': 4.0, '增产': 3}, 
        {'原料': {'覆层生物基板': 1, '钨块': 2, '三氯化铁': 2}, '产物': {'钨蚀刻覆层生物基板': 1}, '设施': '电路蚀刻', '时间': 4.0, '增产': 3}, 
        {'原料': {'硅晶圆': 1}, '产物': {'超低功率IC晶片': 12}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅晶圆': 1}, '产物': {'低功率IC晶片': 12}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛掺杂的硅晶圆': 1}, '产物': {'标准功率IC晶片': 12}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛掺杂的硅晶圆': 1}, '产物': {'高功率IC晶片': 12}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钨掺杂的硅晶圆': 1}, '产物': {'超高功率IC晶片': 12}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钨掺杂的硅晶圆': 1}, '产物': {'生物IC晶片': 12}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'双酚A': 1, '环氧氯丙烷': 1, '氢氧化钠': 3}, '产物': {'环氧树脂': 1, '盐水': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'二氨基联苯胺': 1, '间苯二甲酸二苯酯': 1}, '产物': {'聚苯并咪唑(PBI)': 1, '苯酚': 1}, '设施': '高分子化工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛石': 6, '硝酸': 2}, '产物': {'钨矿': 1}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'钨矿': 2}, '产物': {'钨块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'玻璃': 2, '钨块': 1}, '产物': {'钨强化玻璃': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 2, '钛合金': 4, '钨块': 8}, '产物': {'钨复合金属': 4}, '设施': '冶炼设备', '时间': 12.0, '增产': 3}, 
        {'原料': {'高纯硅块': 16}, '产物': {'硅晶圆': 1}, '设施': '冶炼设备', '时间': 8.0, '增产': 3}, 
        {'原料': {'高纯硅块': 64, '钛块': 16}, '产物': {'钛掺杂的硅晶圆': 2}, '设施': '冶炼设备', '时间': 8.0, '增产': 3}, 
        {'原料': {'高纯硅块': 128, '钨块': 32}, '产物': {'钨掺杂的硅晶圆': 4}, '设施': '冶炼设备', '时间': 8.0, '增产': 3}, 
        {'原料': {'有机晶体': 2}, '产物': {'活性生物纤维': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛块': 2}, '产物': {'钛齿轮': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钨块': 2}, '产物': {'钨齿轮': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'临界光子': 10}, '产物': {'光子结晶': 1}, '设施': '聚变生产', '时间': 60.0, '增产': 3}, 
        {'原料': {'高能石墨': 4}, '产物': {'石墨线圈': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛块': 4}, '产物': {'钛线圈': 2}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'铁块': 2, '齿轮': 2, '电路板': 1}, '产物': {'基础机械组件': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'基础机械组件': 2, '钛齿轮': 2, '处理器': 1}, '产物': {'先进机械组件': 1}, '设施': '制造台', '时间': 4.0, '增产': 3}, 
        {'原料': {'先进机械组件': 2, '钨齿轮': 2, '量子芯片': 1}, '产物': {'尖端机械组件': 1}, '设施': '高精度加工', '时间': 6.0, '增产': 3}, 
        {'原料': {'铁块': 1, '玻璃': 1}, '产物': {'空燃料棒': 1}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'氢': 12}, '产物': {'氢燃料': 1}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'重氢': 6}, '产物': {'氘核燃料': 1}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'反物质': 6}, '产物': {'反物质燃料': 1}, '设施': '化工设备', '时间': 6.0, '增产': 3}, 
        {'原料': {'临界光子': 4}, '产物': {'反物质': 4}, '设施': '粒子对撞机', '时间': 2.0, '增产': 2}, 
        {'原料': {'金刚石': 1, '重氢': 4}, '产物': {'奇异物质': 1}, '设施': '粒子对撞机', '时间': 3.0, '增产': 3}, 
        {'原料': {'可燃冰': 2}, '产物': {'石墨烯': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'原油': 2}, '产物': {'氢': 4}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'剧毒液体': 2}, '产物': {'硫酸': 1, '氨': 1, '氢氯酸': 1, '煤焦油': 1}, '设施': '精炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'高纯硅块': 8, '光栅石': 4}, '产物': {'硅晶圆': 1}, '设施': '冶炼设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'高纯硅块': 32, '钛块': 8, '光栅石': 8}, '产物': {'钛掺杂的硅晶圆': 2}, '设施': '冶炼设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'高纯硅块': 64, '钨块': 16, '光栅石': 16}, '产物': {'钨掺杂的硅晶圆': 4}, '设施': '冶炼设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'活性生物纤维': 12}, '产物': {'聚苯并咪唑(PBI)': 1}, '设施': '精炼设备', '时间': 12.0, '增产': 3}, 
        {'原料': {'有机晶体': 1, '乙烯': 2, '氧': 2}, '产物': {'聚乙烯': 4}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'生物基板': 1, '高功率IC晶片': 2}, '产物': {'处理器': 4}, '设施': '高精度加工', '时间': 3.0, '增产': 3}, 
        {'原料': {'原油': 1}, '产物': {'含硫轻燃油': 1, '含硫重燃油': 3}, '设施': '精炼设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'含硫轻燃油': 2, '氢': 2}, '产物': {'轻燃油': 2, '硫化氢': 1}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'含硫重燃油': 4, '氢': 4}, '产物': {'重燃油': 4, '硫化氢': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'轻燃油': 1, '重燃油': 3}, '产物': {'柴油': 4}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'高能石墨': 2, '水': 2}, '产物': {'一氧化碳': 2, '氢': 2}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'高能石墨': 2, '氧': 4}, '产物': {'二氧化碳': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'一氧化碳': 1, '氢': 4}, '产物': {'甲醇': 1}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'一氧化碳': 2, '氢': 4}, '产物': {'乙酸': 1}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'乙酸': 1, '甲醇': 1}, '产物': {'乙酸甲酯': 1, '水': 1}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'氢氯酸': 2, '氧': 2}, '产物': {'次氯酸': 2}, '设施': '化工设备', '时间': 4.0, '增产': 3}, 
        {'原料': {'硝酸': 4, '乙酸甲酯': 2}, '产物': {'四硝基甲烷': 1, '高能石墨': 5, '水': 8}, '设施': '化工设备', '时间': 3.0, '增产': 3}, 
        {'原料': {'四硝基甲烷': 2, '柴油': 2}, '产物': {'硝基柴油': 1}, '设施': '化工设备', '时间': 8.0, '增产': 3}, 
        {'原料': {'次氯酸': 1, '氨': 2, '甲醇': 2}, '产物': {'偏二甲肼': 1, '氢氯酸': 2}, '设施': '化工设备', '时间': 10.0, '增产': 3}, 
        {'原料': {'偏二甲肼': 4, '硝酸': 4}, '产物': {'火箭燃料': 1}, '设施': '化工设备', '时间': 15.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '硝基柴油': 1, '氧': 10}, '产物': {'硝基柴油燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '偏二甲肼': 1, '硝酸': 1}, '产物': {'偏二甲肼燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '火箭燃料': 1, '氧': 6}, '产物': {'火箭燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'覆层塑料基板': 2, '低功率IC晶片': 4}, '产物': {'微晶元件': 4}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛蚀刻覆层塑料基板': 1, '标准功率IC晶片': 2}, '产物': {'处理器': 2}, '设施': '高精度加工', '时间': 2.0, '增产': 3}, 
        {'原料': {'生物基板': 1, '高功率IC晶片': 2}, '产物': {'量子芯片': 2}, '设施': '高精度加工', '时间': 3.0, '增产': 3}, 
        {'原料': {'硫化氢': 2, '氧': 8}, '产物': {'硫酸': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛合金': 16, '碳纳米管': 8, '量子芯片': 4, '钨强化玻璃': 4}, '产物': {'量子储液罐': 1}, '设施': '制造台', '时间': 15.0, '增产': 3}, 
        {'原料': {'基础机械组件': 3, '钢材': 6}, '产物': {'矿物处理厂': 1}, '设施': '制造台', '时间': 3.0, '增产': 3}, 
        {'原料': {'铁矿': 2}, '产物': {'铁矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿': 2}, '产物': {'铜矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅石': 2}, '产物': {'硅矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛石': 2}, '产物': {'钛矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'石矿': 2}, '产物': {'石粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿': 2}, '产物': {'煤矿粉': 4}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅石': 8, '氢氧化钠': 16}, '产物': {'放射性矿物碎块': 4}, '设施': '矿物处理', '时间': 4.0, '增产': 3}, 
        {'原料': {'放射性矿物碎块': 1, '氢氧化钠': 1}, '产物': {'铀矿': 1}, '设施': '矿物处理', '时间': 4.0, '增产': 3}, 
        {'原料': {'放射性矿物碎块': 1, '氢氧化钠': 1}, '产物': {'钚矿': 1}, '设施': '矿物处理', '时间': 4.0, '增产': 3}, 
        {'原料': {'铀矿': 1}, '产物': {'高纯铀块': 1}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'钚矿': 1}, '产物': {'高纯钚块': 1}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '高纯铀块': 4}, '产物': {'铀燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'空燃料棒': 1, '高纯钚块': 4}, '产物': {'钚燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'钚燃料棒': 1, '铀燃料棒': 2}, '产物': {'MOX燃料棒': 1}, '设施': '制造台', '时间': 10.0, '增产': 3}, 
        {'原料': {'铁矿粉': 2}, '产物': {'铁块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'铜矿粉': 2}, '产物': {'铜块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'硅矿粉': 2}, '产物': {'高纯硅块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钛矿粉': 2}, '产物': {'钛块': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'石粉': 2}, '产物': {'玻璃': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'煤矿粉': 2}, '产物': {'高能石墨': 2}, '设施': '冶炼设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'钢材': 8, '石粉': 16, '金刚石': 4, '水': 8}, '产物': {'混凝土': 4}, '设施': '制造台', '时间': 2.0, '增产': 3}, 
        {'原料': {'先进机械组件': 60, '钛合金': 180, '混凝土': 240, '制造台': 20, '量子芯片': 60}, '产物': {'天穹装配厂': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 30, '钨复合金属': 60, '混凝土': 360, '微型粒子对撞机': 10, '量子芯片': 120}, '产物': {'巨型粒子对撞机': 1}, '设施': '高精度加工', '时间': 300.0, '增产': 3}, 
        {'原料': {'尖端机械组件': 10, '钛合金': 30, '钨强化玻璃': 10, '量子芯片': 10}, '产物': {'聚束液体汲取设施': 1}, '设施': '高精度加工', '时间': 10.0, '增产': 3}, 
        {'原料': {'基础机械组件': 10, '钢材': 30, '混凝土': 20, '超级磁场环': 10}, '产物': {'大气采集站': 1}, '设施': '制造台', '时间': 15.0, '增产': 3}, 
        {'原料': {}, '产物': {'剧毒液体': 1}, '设施': '垃圾回收', '时间': 180.0, '增产': 2}, 
        {'原料': {'氯苯': 1, '水': 1}, '产物': {'苯酚': 1, '氢氯酸': 1}, '设施': '化工设备', '时间': 2.0, '增产': 2}, 
        {'原料': {'煤矿粉': 4}, '产物': {'硫粉': 2}, '设施': '矿物处理', '时间': 2.0, '增产': 3}, 
        {'原料': {'硫粉': 2, '水': 2, '氧': 6}, '产物': {'硫酸': 2}, '设施': '化工设备', '时间': 2.0, '增产': 3}, 
        {'原料': {'电磁矩阵': 1, '能量矩阵': 1}, '产物': {'通量矩阵': 1}, '设施': '制造台', '时间': 3.0, '增产': 2}, 
        {'原料': {'结构矩阵': 1, '信息矩阵': 1}, '产物': {'空间矩阵': 1}, '设施': '制造台', '时间': 3.0, '增产': 2}, 
        {'原料': {'通量矩阵': 1, '空间矩阵': 1, '引力矩阵': 1}, '产物': {'宇宙矩阵粗坯': 1}, '设施': '制造台', '时间': 3.0, '增产': 2}
    ],
        "proliferator_data": [
            {
                "增产剂名称": "不使用增产剂",
                "增产效果": 1,
                "加速效果": 1,
                "耗电倍率": 1,
                "喷涂次数": 1,
                "单次喷涂最高增产点数":0
            },
            {
                "增产剂名称": "增产剂",
                "增产效果": 1.25,
                "加速效果": 2,
                "耗电倍率": 2.5,
                "喷涂次数": 60,
                "单次喷涂最高增产点数":4
            }
        ],
        "proliferate_effect": [
            {
                "增产效果": 1.0,
                "加速效果": 1.0,
                "耗电倍率": 1.0,
            },
            {
                "增产效果": 1.125,
                "加速效果": 1.25,
                "耗电倍率": 1.3,
            },
            {
                "增产效果": 1.2,
                "加速效果": 1.5,
                "耗电倍率": 1.7,
            },
            {
                "增产效果": 1.225,
                "加速效果": 1.75,
                "耗电倍率": 2.1,
            },
            {
                "增产效果": 1.25,
                "加速效果": 2.0,
                "耗电倍率": 2.5,
            },
            {
                "增产效果": 1.275,
                "加速效果": 2.25,
                "耗电倍率": 2.9,
            },
            {
                "增产效果": 1.3,
                "加速效果": 2.5,
                "耗电倍率": 3.3,
            },
            {
                "增产效果": 1.325,
                "加速效果": 2.75,
                "耗电倍率": 3.7,
            },
            {
                "增产效果": 1.35,
                "加速效果": 3.0,
                "耗电倍率": 4.1,
            },
            {
                "增产效果": 1.375,
                "加速效果": 3.25,
                "耗电倍率": 4.5,
            },
            {
                "增产效果": 1.4,
                "加速效果": 3.5,
                "耗电倍率": 4.9,
            },
        ],
        "factory_data": {
            '行星大气': [
                { '名称': '大气采集站', '耗能': 0, '倍率': 4, '占地': 0.01 },
            ],
            '矿物处理': [
                { '名称': '矿物处理厂', '耗能': 0.72, '倍率': 2, '占地': 5.76 },
                { '名称': '物质裂解塔', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '垃圾回收': [
                { '名称': '物质分解设施', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '轻型工业机甲': [
                { '名称': '伊卡洛斯', '耗能': 0.08, '倍率': 1, '占地': 0.01 },
            ],
            '采矿设备': [
                { '名称': '采矿机', '耗能': 0.42, '倍率': 1, '占地': 15 },
                { '名称': '大型采矿机', '耗能': 2.94, '倍率': 2, '占地': 25 },
            ],
            '抽水设备': [
                { '名称': '抽水站', '耗能': 0.3, '倍率': 10/6, '占地': 12 },
                { '名称': '聚束液体汲取设施', '耗能': 30, '倍率': 1000, '占地': 12 },
            ],
            '抽油设备': [
                { '名称': '原油萃取站', '耗能': 0.84, '倍率': 2, '占地': 50 },
            ],
            '巨星采集': [
                { '名称': '轨道采集器', '耗能': 30, '倍率': 18, '占地': 0.01 },
            ],
            '射线接收站': [
                { '名称': '射线接收站', '耗能': 0, '倍率': 1, '占地': 54.82 },
            ],
            '冶炼设备': [
                { '名称': '电弧熔炉', '耗能': 0.72, '倍率': 2, '占地': 5.76 },
                { '名称': '位面熔炉', '耗能': 1.44, '倍率': 4, '占地': 5.76 },
                { '名称': '物质裂解塔', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '制造台': [
                { '名称': '制造台', '耗能': 0.54, '倍率': 2, '占地': 2 },
                { '名称': '天穹装配厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '电路蚀刻': [
                { '名称': '电路蚀刻机', '耗能': 1.08, '倍率': 2, '占地': 10.24 },
                { '名称': '精密结构组装厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '高精度加工': [
                { '名称': '高精度装配线', '耗能': 2.16, '倍率': 2, '占地': 10.24 },
                { '名称': '精密结构组装厂', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '精密组装': [
                { '名称': '精密制造厂', '耗能': 2400, '倍率': 1, '占地': 10.24 },
            ],
            '精炼设备': [
                { '名称': '精炼厂', '耗能': 0.96, '倍率': 4, '占地': 18 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 }
            ],
            '化工设备': [
                { '名称': '化工厂', '耗能': 0.72, '倍率': 4, '占地': 23.76 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 }
            ],
            '高分子化工': [
                { '名称': '先进化学反应釜', '耗能': 1.44, '倍率': 4, '占地': 23.76 },
                { '名称': '巨型化学反应釜', '耗能': 30, '倍率': 40, '占地': 50 },
            ],
            '粒子对撞机': [
                { '名称': '微型粒子对撞机', '耗能': 12, '倍率': 4, '占地': 45.12 },
                { '名称': '巨型粒子对撞机', '耗能': 60, '倍率': 40, '占地': 50 },
            ],
            '聚变生产': [
                { '名称': '紧凑式回旋加速器', '耗能': 4800, '倍率': 1, '占地': 45.12 },
            ],
            '科研设备': [
                { '名称': '矩阵研究站', '耗能': 0.48, '倍率': 1, '占地': 20.25 },
            ],
            '充电设备': [
                { '名称': '能量枢纽', '耗能': 600, '倍率': 200, '占地': 64 },
                { '名称': '蓄电器', '耗能': 9, '倍率': 3, '占地': 4 },
            ]
    
        }
    }
};