const icon_layout_csv = `
铁块,铜块,高纯硅块,钛块,石材,高能石墨,精炼油,石墨烯,塑料,增产剂MK.Ⅰ,增产剂MK.Ⅱ,增产剂MK.Ⅲ
磁铁,磁线圈,晶格硅,钛合金,玻璃,金刚石,*原油,*可燃冰,有机晶体,液氢燃料棒,氘核燃料棒,反物质燃料棒
钢材,电动机,*分形硅石,钛化玻璃,棱镜,*金伯利矿石,,钛晶石,,推进器,加力推进器,奇异物质
齿轮,电磁涡轮,硅石,电路板,引力透镜,硫酸,氢,碳纳米管,配送运输机,物流运输机,星际物流运输船,小型运载火箭
电浆激发器,超级磁场环,粒子宽带,处理器,卡西米尔晶体,粒子容器,重氢,*刺笋结晶,位面过滤器,太阳帆,框架材料,戴森球组件
光子合并器,*光栅石,微晶元件,量子芯片,*光栅石,*单极磁石,空间翘曲器,,反物质,湮灭约束球,,
电磁矩阵,能量矩阵,结构矩阵,信息矩阵,引力矩阵,宇宙矩阵,,,,,,地基

临界光子,反物质,蓄电器（满）,木材,水,煤矿,石矿,钛石,铁矿,铜矿

电力感应塔,无线输电塔,卫星配电站,风力涡轮机,火力发电机,太阳能板,蓄电器,地热发电站,微型聚变发电站,能量枢纽,射线接收站,人造恒星
传送带,高速传送带,极速传送带,四向分流器,自动集装机,小型储物仓,大型储物仓,储液罐,物流配送器,行星内物流运输站,星际物流运输站,轨道采集器
分拣器,高速分拣器,极速分拣器,流速监测器,采矿机,大型采矿机,抽水机,原油萃取站,原油精炼厂,微型粒子对撞机,电磁轨道弹射器,垂直发射井
制造台MK.Ⅰ,制造台MK.Ⅱ,制造台MK.Ⅲ,电弧熔炉,位面熔炉,研究站,喷涂机,分馏塔,化工厂,量子化工厂,,
`;

export const icon_layout = icon_layout_csv.trim().split("\n").map(line => {
    let items = line.split(",");
    console.assert(items.length == 1 || items.length == 12, items.length, items);
    return items.length > 1 ? items : [];
});
